#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_RaceSequenceStateGadgetPlate

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UnionUI_structs.hpp"
#include "UNION_structs.hpp"
#include "UNION_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPC_RaceSequenceStateGadgetPlate.BPC_RaceSequenceStateGadgetPlate_C
// 0x0018 (0x0128 - 0x0110)
class UBPC_RaceSequenceStateGadgetPlate_C final : public URaceSequenceStateGadgetPlate
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0110(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_RaceGadgetPlateSequence_C*          GadgetPlateSequence;                               // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UWBP_EndMenu_GudgetLv_Window_C*         ResultGadgetPlateWidget;                           // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPC_RaceSequenceStateGadgetPlate(int32 EntryPoint);
	void OnExitFade(EUnionUIFadeDirection FadeDirection);
	void OnExitState();
	void OnInitState();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void カスタムイベント();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPC_RaceSequenceStateGadgetPlate_C">();
	}
	static class UBPC_RaceSequenceStateGadgetPlate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_RaceSequenceStateGadgetPlate_C>();
	}
};
static_assert(alignof(UBPC_RaceSequenceStateGadgetPlate_C) == 0x000008, "Wrong alignment on UBPC_RaceSequenceStateGadgetPlate_C");
static_assert(sizeof(UBPC_RaceSequenceStateGadgetPlate_C) == 0x000128, "Wrong size on UBPC_RaceSequenceStateGadgetPlate_C");
static_assert(offsetof(UBPC_RaceSequenceStateGadgetPlate_C, UberGraphFrame) == 0x000110, "Member 'UBPC_RaceSequenceStateGadgetPlate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPC_RaceSequenceStateGadgetPlate_C, GadgetPlateSequence) == 0x000118, "Member 'UBPC_RaceSequenceStateGadgetPlate_C::GadgetPlateSequence' has a wrong offset!");
static_assert(offsetof(UBPC_RaceSequenceStateGadgetPlate_C, ResultGadgetPlateWidget) == 0x000120, "Member 'UBPC_RaceSequenceStateGadgetPlate_C::ResultGadgetPlateWidget' has a wrong offset!");

}

