#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_PreNotice

#include "Basic.hpp"

#include "UnionUI_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPC_PreNotice.BPC_PreNotice_C.PlayStoredBgm
// 0x0010 (0x0010 - 0x0000)
struct BPC_PreNotice_C_PlayStoredBgm final
{
public:
	class UMenuSoundSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PreNotice_C_PlayStoredBgm) == 0x000008, "Wrong alignment on BPC_PreNotice_C_PlayStoredBgm");
static_assert(sizeof(BPC_PreNotice_C_PlayStoredBgm) == 0x000010, "Wrong size on BPC_PreNotice_C_PlayStoredBgm");
static_assert(offsetof(BPC_PreNotice_C_PlayStoredBgm, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000000, "Member 'BPC_PreNotice_C_PlayStoredBgm::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_PlayStoredBgm, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000008, "Member 'BPC_PreNotice_C_PlayStoredBgm::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BPC_PreNotice.BPC_PreNotice_C.StorePrevBgmID
// 0x00A0 (0x00A0 - 0x0000)
struct BPC_PreNotice_C_StorePrevBgmID final
{
public:
	class UMenuSoundSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceBGM                              CallFunc_GetPlayMenuType_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0018(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0080(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PreNotice_C_StorePrevBgmID) == 0x000008, "Wrong alignment on BPC_PreNotice_C_StorePrevBgmID");
static_assert(sizeof(BPC_PreNotice_C_StorePrevBgmID) == 0x0000A0, "Wrong size on BPC_PreNotice_C_StorePrevBgmID");
static_assert(offsetof(BPC_PreNotice_C_StorePrevBgmID, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000000, "Member 'BPC_PreNotice_C_StorePrevBgmID::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_StorePrevBgmID, CallFunc_GetEnumeratorName_ReturnValue) == 0x000008, "Member 'BPC_PreNotice_C_StorePrevBgmID::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_StorePrevBgmID, CallFunc_GetPlayMenuType_ReturnValue) == 0x000010, "Member 'BPC_PreNotice_C_StorePrevBgmID::CallFunc_GetPlayMenuType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_StorePrevBgmID, CallFunc_Conv_NameToText_ReturnValue) == 0x000018, "Member 'BPC_PreNotice_C_StorePrevBgmID::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_StorePrevBgmID, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'BPC_PreNotice_C_StorePrevBgmID::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_StorePrevBgmID, K2Node_MakeArray_Array) == 0x000070, "Member 'BPC_PreNotice_C_StorePrevBgmID::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_StorePrevBgmID, CallFunc_Format_ReturnValue) == 0x000080, "Member 'BPC_PreNotice_C_StorePrevBgmID::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_StorePrevBgmID, CallFunc_Conv_TextToString_ReturnValue) == 0x000090, "Member 'BPC_PreNotice_C_StorePrevBgmID::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function BPC_PreNotice.BPC_PreNotice_C.IsFestaForceStart
// 0x0018 (0x0018 - 0x0000)
struct BPC_PreNotice_C_IsFestaForceStart final
{
public:
	bool                                          isForceStart;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAppDataManageSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFestaForceNotice_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFestaForceStart_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PreNotice_C_IsFestaForceStart) == 0x000008, "Wrong alignment on BPC_PreNotice_C_IsFestaForceStart");
static_assert(sizeof(BPC_PreNotice_C_IsFestaForceStart) == 0x000018, "Wrong size on BPC_PreNotice_C_IsFestaForceStart");
static_assert(offsetof(BPC_PreNotice_C_IsFestaForceStart, isForceStart) == 0x000000, "Member 'BPC_PreNotice_C_IsFestaForceStart::isForceStart' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_IsFestaForceStart, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'BPC_PreNotice_C_IsFestaForceStart::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_IsFestaForceStart, CallFunc_IsFestaForceNotice_ReturnValue) == 0x000010, "Member 'BPC_PreNotice_C_IsFestaForceStart::CallFunc_IsFestaForceNotice_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_IsFestaForceStart, CallFunc_IsFestaForceStart_ReturnValue) == 0x000011, "Member 'BPC_PreNotice_C_IsFestaForceStart::CallFunc_IsFestaForceStart_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_IsFestaForceStart, CallFunc_BooleanOR_ReturnValue) == 0x000012, "Member 'BPC_PreNotice_C_IsFestaForceStart::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BPC_PreNotice.BPC_PreNotice_C.CallDodonpaEvent
// 0x0038 (0x0038 - 0x0000)
struct BPC_PreNotice_C_CallDodonpaEvent final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGrandPrixEventFlag                           SaveDataFlagId;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceBGM                              BGM_ID;                                            // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerSequence_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_OnlineSequence_C*                   K2Node_DynamicCast_AsBP_Online_Sequence;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TopMenuSequence_C*                  K2Node_DynamicCast_AsBP_Top_Menu_Sequence;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PreNotice_C_CallDodonpaEvent) == 0x000008, "Wrong alignment on BPC_PreNotice_C_CallDodonpaEvent");
static_assert(sizeof(BPC_PreNotice_C_CallDodonpaEvent) == 0x000038, "Wrong size on BPC_PreNotice_C_CallDodonpaEvent");
static_assert(offsetof(BPC_PreNotice_C_CallDodonpaEvent, EventName) == 0x000000, "Member 'BPC_PreNotice_C_CallDodonpaEvent::EventName' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_CallDodonpaEvent, SaveDataFlagId) == 0x000008, "Member 'BPC_PreNotice_C_CallDodonpaEvent::SaveDataFlagId' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_CallDodonpaEvent, BGM_ID) == 0x000009, "Member 'BPC_PreNotice_C_CallDodonpaEvent::BGM_ID' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_CallDodonpaEvent, CallFunc_GetOwnerSequence_ReturnValue) == 0x000010, "Member 'BPC_PreNotice_C_CallDodonpaEvent::CallFunc_GetOwnerSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_CallDodonpaEvent, K2Node_DynamicCast_AsBP_Online_Sequence) == 0x000018, "Member 'BPC_PreNotice_C_CallDodonpaEvent::K2Node_DynamicCast_AsBP_Online_Sequence' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_CallDodonpaEvent, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BPC_PreNotice_C_CallDodonpaEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_CallDodonpaEvent, K2Node_DynamicCast_AsBP_Top_Menu_Sequence) == 0x000028, "Member 'BPC_PreNotice_C_CallDodonpaEvent::K2Node_DynamicCast_AsBP_Top_Menu_Sequence' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_CallDodonpaEvent, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BPC_PreNotice_C_CallDodonpaEvent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BPC_PreNotice.BPC_PreNotice_C.SetSubMenuVisibility
// 0x0038 (0x0038 - 0x0000)
struct BPC_PreNotice_C_SetSubMenuVisibility final
{
public:
	ESlateVisibility                              Visibility;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerSequence_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_OnlineSequence_C*                   K2Node_DynamicCast_AsBP_Online_Sequence;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerSequence_ReturnValue_1;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_TopMenuSequence_C*                  K2Node_DynamicCast_AsBP_Top_Menu_Sequence;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PreNotice_C_SetSubMenuVisibility) == 0x000008, "Wrong alignment on BPC_PreNotice_C_SetSubMenuVisibility");
static_assert(sizeof(BPC_PreNotice_C_SetSubMenuVisibility) == 0x000038, "Wrong size on BPC_PreNotice_C_SetSubMenuVisibility");
static_assert(offsetof(BPC_PreNotice_C_SetSubMenuVisibility, Visibility) == 0x000000, "Member 'BPC_PreNotice_C_SetSubMenuVisibility::Visibility' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_SetSubMenuVisibility, CallFunc_GetOwnerSequence_ReturnValue) == 0x000008, "Member 'BPC_PreNotice_C_SetSubMenuVisibility::CallFunc_GetOwnerSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_SetSubMenuVisibility, K2Node_DynamicCast_AsBP_Online_Sequence) == 0x000010, "Member 'BPC_PreNotice_C_SetSubMenuVisibility::K2Node_DynamicCast_AsBP_Online_Sequence' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_SetSubMenuVisibility, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BPC_PreNotice_C_SetSubMenuVisibility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_SetSubMenuVisibility, CallFunc_GetOwnerSequence_ReturnValue_1) == 0x000020, "Member 'BPC_PreNotice_C_SetSubMenuVisibility::CallFunc_GetOwnerSequence_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_SetSubMenuVisibility, K2Node_DynamicCast_AsBP_Top_Menu_Sequence) == 0x000028, "Member 'BPC_PreNotice_C_SetSubMenuVisibility::K2Node_DynamicCast_AsBP_Top_Menu_Sequence' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_SetSubMenuVisibility, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BPC_PreNotice_C_SetSubMenuVisibility::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BPC_PreNotice.BPC_PreNotice_C.AttachMainCamera
// 0x0028 (0x0028 - 0x0000)
struct BPC_PreNotice_C_AttachMainCamera final
{
public:
	class AActor*                                 CallFunc_GetOwnerSequence_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_OnlineSequence_C*                   K2Node_DynamicCast_AsBP_Online_Sequence;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TopMenuSequence_C*                  K2Node_DynamicCast_AsBP_Top_Menu_Sequence;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PreNotice_C_AttachMainCamera) == 0x000008, "Wrong alignment on BPC_PreNotice_C_AttachMainCamera");
static_assert(sizeof(BPC_PreNotice_C_AttachMainCamera) == 0x000028, "Wrong size on BPC_PreNotice_C_AttachMainCamera");
static_assert(offsetof(BPC_PreNotice_C_AttachMainCamera, CallFunc_GetOwnerSequence_ReturnValue) == 0x000000, "Member 'BPC_PreNotice_C_AttachMainCamera::CallFunc_GetOwnerSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_AttachMainCamera, K2Node_DynamicCast_AsBP_Online_Sequence) == 0x000008, "Member 'BPC_PreNotice_C_AttachMainCamera::K2Node_DynamicCast_AsBP_Online_Sequence' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_AttachMainCamera, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BPC_PreNotice_C_AttachMainCamera::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_AttachMainCamera, K2Node_DynamicCast_AsBP_Top_Menu_Sequence) == 0x000018, "Member 'BPC_PreNotice_C_AttachMainCamera::K2Node_DynamicCast_AsBP_Top_Menu_Sequence' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_AttachMainCamera, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'BPC_PreNotice_C_AttachMainCamera::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BPC_PreNotice.BPC_PreNotice_C.EndTutorialPopup
// 0x0001 (0x0001 - 0x0000)
struct BPC_PreNotice_C_EndTutorialPopup final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PreNotice_C_EndTutorialPopup) == 0x000001, "Wrong alignment on BPC_PreNotice_C_EndTutorialPopup");
static_assert(sizeof(BPC_PreNotice_C_EndTutorialPopup) == 0x000001, "Wrong size on BPC_PreNotice_C_EndTutorialPopup");
static_assert(offsetof(BPC_PreNotice_C_EndTutorialPopup, InVisibility) == 0x000000, "Member 'BPC_PreNotice_C_EndTutorialPopup::InVisibility' has a wrong offset!");

// Function BPC_PreNotice.BPC_PreNotice_C.OnFinishedFade
// 0x0001 (0x0001 - 0x0000)
struct BPC_PreNotice_C_OnFinishedFade final
{
public:
	EUnionUIFadeDirection                         FadeDirection;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PreNotice_C_OnFinishedFade) == 0x000001, "Wrong alignment on BPC_PreNotice_C_OnFinishedFade");
static_assert(sizeof(BPC_PreNotice_C_OnFinishedFade) == 0x000001, "Wrong size on BPC_PreNotice_C_OnFinishedFade");
static_assert(offsetof(BPC_PreNotice_C_OnFinishedFade, FadeDirection) == 0x000000, "Member 'BPC_PreNotice_C_OnFinishedFade::FadeDirection' has a wrong offset!");

// Function BPC_PreNotice.BPC_PreNotice_C.OnDodonpaEventEnd_GrandPrixCleard
// 0x0001 (0x0001 - 0x0000)
struct BPC_PreNotice_C_OnDodonpaEventEnd_GrandPrixCleard final
{
public:
	EMenuSequenceSubState                         State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PreNotice_C_OnDodonpaEventEnd_GrandPrixCleard) == 0x000001, "Wrong alignment on BPC_PreNotice_C_OnDodonpaEventEnd_GrandPrixCleard");
static_assert(sizeof(BPC_PreNotice_C_OnDodonpaEventEnd_GrandPrixCleard) == 0x000001, "Wrong size on BPC_PreNotice_C_OnDodonpaEventEnd_GrandPrixCleard");
static_assert(offsetof(BPC_PreNotice_C_OnDodonpaEventEnd_GrandPrixCleard, State) == 0x000000, "Member 'BPC_PreNotice_C_OnDodonpaEventEnd_GrandPrixCleard::State' has a wrong offset!");

// Function BPC_PreNotice.BPC_PreNotice_C.OnDodonpaEvent_FestaIntro
// 0x0001 (0x0001 - 0x0000)
struct BPC_PreNotice_C_OnDodonpaEvent_FestaIntro final
{
public:
	EMenuSequenceSubState                         State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PreNotice_C_OnDodonpaEvent_FestaIntro) == 0x000001, "Wrong alignment on BPC_PreNotice_C_OnDodonpaEvent_FestaIntro");
static_assert(sizeof(BPC_PreNotice_C_OnDodonpaEvent_FestaIntro) == 0x000001, "Wrong size on BPC_PreNotice_C_OnDodonpaEvent_FestaIntro");
static_assert(offsetof(BPC_PreNotice_C_OnDodonpaEvent_FestaIntro, State) == 0x000000, "Member 'BPC_PreNotice_C_OnDodonpaEvent_FestaIntro::State' has a wrong offset!");

// Function BPC_PreNotice.BPC_PreNotice_C.OnEndFade_FestaIntro
// 0x0001 (0x0001 - 0x0000)
struct BPC_PreNotice_C_OnEndFade_FestaIntro final
{
public:
	EUnionUIFadeDirection                         FadeDirection;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PreNotice_C_OnEndFade_FestaIntro) == 0x000001, "Wrong alignment on BPC_PreNotice_C_OnEndFade_FestaIntro");
static_assert(sizeof(BPC_PreNotice_C_OnEndFade_FestaIntro) == 0x000001, "Wrong size on BPC_PreNotice_C_OnEndFade_FestaIntro");
static_assert(offsetof(BPC_PreNotice_C_OnEndFade_FestaIntro, FadeDirection) == 0x000000, "Member 'BPC_PreNotice_C_OnEndFade_FestaIntro::FadeDirection' has a wrong offset!");

// Function BPC_PreNotice.BPC_PreNotice_C.OnEndFade_GrandPrixCleard
// 0x0001 (0x0001 - 0x0000)
struct BPC_PreNotice_C_OnEndFade_GrandPrixCleard final
{
public:
	EUnionUIFadeDirection                         FadeDirection;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PreNotice_C_OnEndFade_GrandPrixCleard) == 0x000001, "Wrong alignment on BPC_PreNotice_C_OnEndFade_GrandPrixCleard");
static_assert(sizeof(BPC_PreNotice_C_OnEndFade_GrandPrixCleard) == 0x000001, "Wrong size on BPC_PreNotice_C_OnEndFade_GrandPrixCleard");
static_assert(offsetof(BPC_PreNotice_C_OnEndFade_GrandPrixCleard, FadeDirection) == 0x000000, "Member 'BPC_PreNotice_C_OnEndFade_GrandPrixCleard::FadeDirection' has a wrong offset!");

// Function BPC_PreNotice.BPC_PreNotice_C.OnFinishedFade_TutorialPopup
// 0x0001 (0x0001 - 0x0000)
struct BPC_PreNotice_C_OnFinishedFade_TutorialPopup final
{
public:
	EUnionUIFadeDirection                         FadeDirection;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PreNotice_C_OnFinishedFade_TutorialPopup) == 0x000001, "Wrong alignment on BPC_PreNotice_C_OnFinishedFade_TutorialPopup");
static_assert(sizeof(BPC_PreNotice_C_OnFinishedFade_TutorialPopup) == 0x000001, "Wrong size on BPC_PreNotice_C_OnFinishedFade_TutorialPopup");
static_assert(offsetof(BPC_PreNotice_C_OnFinishedFade_TutorialPopup, FadeDirection) == 0x000000, "Member 'BPC_PreNotice_C_OnFinishedFade_TutorialPopup::FadeDirection' has a wrong offset!");

// Function BPC_PreNotice.BPC_PreNotice_C.OnDecisionStreamingInstall
// 0x0010 (0x0010 - 0x0000)
struct BPC_PreNotice_C_OnDecisionStreamingInstall final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PreNotice_C_OnDecisionStreamingInstall) == 0x000008, "Wrong alignment on BPC_PreNotice_C_OnDecisionStreamingInstall");
static_assert(sizeof(BPC_PreNotice_C_OnDecisionStreamingInstall) == 0x000010, "Wrong size on BPC_PreNotice_C_OnDecisionStreamingInstall");
static_assert(offsetof(BPC_PreNotice_C_OnDecisionStreamingInstall, Button) == 0x000000, "Member 'BPC_PreNotice_C_OnDecisionStreamingInstall::Button' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_OnDecisionStreamingInstall, PanelIndex) == 0x000008, "Member 'BPC_PreNotice_C_OnDecisionStreamingInstall::PanelIndex' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_OnDecisionStreamingInstall, ButtonIndex) == 0x00000C, "Member 'BPC_PreNotice_C_OnDecisionStreamingInstall::ButtonIndex' has a wrong offset!");

// Function BPC_PreNotice.BPC_PreNotice_C.OnReceiveCheckCompensation
// 0x0038 (0x0038 - 0x0000)
struct BPC_PreNotice_C_OnReceiveCheckCompensation final
{
public:
	class FString                                 ApiName;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 RequestData;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ResponseData;                                      // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Error;                                             // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PreNotice_C_OnReceiveCheckCompensation) == 0x000008, "Wrong alignment on BPC_PreNotice_C_OnReceiveCheckCompensation");
static_assert(sizeof(BPC_PreNotice_C_OnReceiveCheckCompensation) == 0x000038, "Wrong size on BPC_PreNotice_C_OnReceiveCheckCompensation");
static_assert(offsetof(BPC_PreNotice_C_OnReceiveCheckCompensation, ApiName) == 0x000000, "Member 'BPC_PreNotice_C_OnReceiveCheckCompensation::ApiName' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_OnReceiveCheckCompensation, RequestData) == 0x000010, "Member 'BPC_PreNotice_C_OnReceiveCheckCompensation::RequestData' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_OnReceiveCheckCompensation, ResponseData) == 0x000020, "Member 'BPC_PreNotice_C_OnReceiveCheckCompensation::ResponseData' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_OnReceiveCheckCompensation, Error) == 0x000030, "Member 'BPC_PreNotice_C_OnReceiveCheckCompensation::Error' has a wrong offset!");

// Function BPC_PreNotice.BPC_PreNotice_C.OnReceiveCheckFestaReward
// 0x0038 (0x0038 - 0x0000)
struct BPC_PreNotice_C_OnReceiveCheckFestaReward final
{
public:
	class FString                                 ApiName;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 RequestData;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ResponseData;                                      // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Error;                                             // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PreNotice_C_OnReceiveCheckFestaReward) == 0x000008, "Wrong alignment on BPC_PreNotice_C_OnReceiveCheckFestaReward");
static_assert(sizeof(BPC_PreNotice_C_OnReceiveCheckFestaReward) == 0x000038, "Wrong size on BPC_PreNotice_C_OnReceiveCheckFestaReward");
static_assert(offsetof(BPC_PreNotice_C_OnReceiveCheckFestaReward, ApiName) == 0x000000, "Member 'BPC_PreNotice_C_OnReceiveCheckFestaReward::ApiName' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_OnReceiveCheckFestaReward, RequestData) == 0x000010, "Member 'BPC_PreNotice_C_OnReceiveCheckFestaReward::RequestData' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_OnReceiveCheckFestaReward, ResponseData) == 0x000020, "Member 'BPC_PreNotice_C_OnReceiveCheckFestaReward::ResponseData' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_OnReceiveCheckFestaReward, Error) == 0x000030, "Member 'BPC_PreNotice_C_OnReceiveCheckFestaReward::Error' has a wrong offset!");

// Function BPC_PreNotice.BPC_PreNotice_C.OnErrorPopupWindowClose
// 0x0010 (0x0010 - 0x0000)
struct BPC_PreNotice_C_OnErrorPopupWindowClose final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PreNotice_C_OnErrorPopupWindowClose) == 0x000008, "Wrong alignment on BPC_PreNotice_C_OnErrorPopupWindowClose");
static_assert(sizeof(BPC_PreNotice_C_OnErrorPopupWindowClose) == 0x000010, "Wrong size on BPC_PreNotice_C_OnErrorPopupWindowClose");
static_assert(offsetof(BPC_PreNotice_C_OnErrorPopupWindowClose, Button) == 0x000000, "Member 'BPC_PreNotice_C_OnErrorPopupWindowClose::Button' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_OnErrorPopupWindowClose, PanelIndex) == 0x000008, "Member 'BPC_PreNotice_C_OnErrorPopupWindowClose::PanelIndex' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_OnErrorPopupWindowClose, ButtonIndex) == 0x00000C, "Member 'BPC_PreNotice_C_OnErrorPopupWindowClose::ButtonIndex' has a wrong offset!");

// Function BPC_PreNotice.BPC_PreNotice_C.OnDodonpaEventEnd_LegendInfo
// 0x0001 (0x0001 - 0x0000)
struct BPC_PreNotice_C_OnDodonpaEventEnd_LegendInfo final
{
public:
	EMenuSequenceSubState                         State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PreNotice_C_OnDodonpaEventEnd_LegendInfo) == 0x000001, "Wrong alignment on BPC_PreNotice_C_OnDodonpaEventEnd_LegendInfo");
static_assert(sizeof(BPC_PreNotice_C_OnDodonpaEventEnd_LegendInfo) == 0x000001, "Wrong size on BPC_PreNotice_C_OnDodonpaEventEnd_LegendInfo");
static_assert(offsetof(BPC_PreNotice_C_OnDodonpaEventEnd_LegendInfo, State) == 0x000000, "Member 'BPC_PreNotice_C_OnDodonpaEventEnd_LegendInfo::State' has a wrong offset!");

// Function BPC_PreNotice.BPC_PreNotice_C.OnEndFade_LegendInfo
// 0x0001 (0x0001 - 0x0000)
struct BPC_PreNotice_C_OnEndFade_LegendInfo final
{
public:
	EUnionUIFadeDirection                         FadeDirection;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PreNotice_C_OnEndFade_LegendInfo) == 0x000001, "Wrong alignment on BPC_PreNotice_C_OnEndFade_LegendInfo");
static_assert(sizeof(BPC_PreNotice_C_OnEndFade_LegendInfo) == 0x000001, "Wrong size on BPC_PreNotice_C_OnEndFade_LegendInfo");
static_assert(offsetof(BPC_PreNotice_C_OnEndFade_LegendInfo, FadeDirection) == 0x000000, "Member 'BPC_PreNotice_C_OnEndFade_LegendInfo::FadeDirection' has a wrong offset!");

// Function BPC_PreNotice.BPC_PreNotice_C.OnReceiveCheckLegendCompeReward
// 0x0038 (0x0038 - 0x0000)
struct BPC_PreNotice_C_OnReceiveCheckLegendCompeReward final
{
public:
	class FString                                 ApiName;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 RequestData;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ResponseData;                                      // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Error;                                             // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PreNotice_C_OnReceiveCheckLegendCompeReward) == 0x000008, "Wrong alignment on BPC_PreNotice_C_OnReceiveCheckLegendCompeReward");
static_assert(sizeof(BPC_PreNotice_C_OnReceiveCheckLegendCompeReward) == 0x000038, "Wrong size on BPC_PreNotice_C_OnReceiveCheckLegendCompeReward");
static_assert(offsetof(BPC_PreNotice_C_OnReceiveCheckLegendCompeReward, ApiName) == 0x000000, "Member 'BPC_PreNotice_C_OnReceiveCheckLegendCompeReward::ApiName' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_OnReceiveCheckLegendCompeReward, RequestData) == 0x000010, "Member 'BPC_PreNotice_C_OnReceiveCheckLegendCompeReward::RequestData' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_OnReceiveCheckLegendCompeReward, ResponseData) == 0x000020, "Member 'BPC_PreNotice_C_OnReceiveCheckLegendCompeReward::ResponseData' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_OnReceiveCheckLegendCompeReward, Error) == 0x000030, "Member 'BPC_PreNotice_C_OnReceiveCheckLegendCompeReward::Error' has a wrong offset!");

// Function BPC_PreNotice.BPC_PreNotice_C.OnAttentionPopupWindowDecision
// 0x0010 (0x0010 - 0x0000)
struct BPC_PreNotice_C_OnAttentionPopupWindowDecision final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_PreNotice_C_OnAttentionPopupWindowDecision) == 0x000008, "Wrong alignment on BPC_PreNotice_C_OnAttentionPopupWindowDecision");
static_assert(sizeof(BPC_PreNotice_C_OnAttentionPopupWindowDecision) == 0x000010, "Wrong size on BPC_PreNotice_C_OnAttentionPopupWindowDecision");
static_assert(offsetof(BPC_PreNotice_C_OnAttentionPopupWindowDecision, Button) == 0x000000, "Member 'BPC_PreNotice_C_OnAttentionPopupWindowDecision::Button' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_OnAttentionPopupWindowDecision, PanelIndex) == 0x000008, "Member 'BPC_PreNotice_C_OnAttentionPopupWindowDecision::PanelIndex' has a wrong offset!");
static_assert(offsetof(BPC_PreNotice_C_OnAttentionPopupWindowDecision, ButtonIndex) == 0x00000C, "Member 'BPC_PreNotice_C_OnAttentionPopupWindowDecision::ButtonIndex' has a wrong offset!");

// Function BPC_PreNotice.BPC_PreNotice_C.ExecuteUbergraph_BPC_PreNotice
// 0x0780 (0x0780 - 0x0000)
struct BPC_PreNotice_C_ExecuteUbergraph_BPC_PreNotice final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerSequence_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_TopMenuSequence_C*                  K2Node_DynamicCast_AsBP_Top_Menu_Sequence;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EMenuSequenceSubState State)>  K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartCompensationWindow_OutIsOpenWindow;  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerSequence_ReturnValue_1;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_TopMenuSequence_C*                  K2Node_DynamicCast_AsBP_Top_Menu_Sequence_1;       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionUIFadeDirection                         K2Node_CustomEvent_FadeDirection_4;                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACameraActor*                           CallFunc_GetDodonpaEventCamera_Camera;             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate_1;           // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EUnionUIFadeDirection FadeDirection)> K2Node_CreateDelegate_OutputDelegate_2;     // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUITransitionManager*              CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwnerSequence_ReturnValue_2;           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TopMenuSequence_C*                  K2Node_DynamicCast_AsBP_Top_Menu_Sequence_2;       // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStartDLCInfomation_ReturnValue;         // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStartFestaInfomation_ReturnValue;       // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStartLegendInfomation_ReturnValue;      // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckDodonpaEventCondition_ReturnValue;   // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceSubState                         K2Node_CustomEvent_State_2;                        // 0x009F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMenuSequenceSubState                         K2Node_CustomEvent_State_1;                        // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCompensationGetCompensationsResponse_ReceivableCompensationData> CallFunc_CreateCanUseCompensationDataArray_OutCanUseReceiveData; // 0x00A8(0x0010)(ReferenceParm)
	TArray<struct FRewardGetWindowParamWithTitle> CallFunc_CreateCanUseCompensationDataArray_OutWindowParamData; // 0x00B8(0x0010)(ReferenceParm)
	EUnionUIFadeDirection                         K2Node_CustomEvent_FadeDirection_3;                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionUIFadeDirection                         K2Node_CustomEvent_FadeDirection_2;                // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerSequence_ReturnValue_3;           // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_OnlineSequence_C*                   K2Node_DynamicCast_AsBP_Online_Sequence;           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerSequence_ReturnValue_4;           // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_TopMenuSequence_C*                  K2Node_DynamicCast_AsBP_Top_Menu_Sequence_3;       // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_OnlineSequence_C*                   K2Node_DynamicCast_AsBP_Online_Sequence_1;         // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionUIFadeDirection                         K2Node_CustomEvent_FadeDirection_1;                // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerSequence_ReturnValue_5;           // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_TopMenuSequence_C*                  K2Node_DynamicCast_AsBP_Top_Menu_Sequence_4;       // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStartedStreamingInstall_ReturnValue;    // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x2];                                      // 0x0122(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EMenuSequenceSubState State)>  K2Node_CreateDelegate_OutputDelegate_3;            // 0x0124(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EUnionUIFadeDirection FadeDirection)> K2Node_CreateDelegate_OutputDelegate_4;     // 0x0134(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuSoundSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UForceNextSequenceManagerSubsytem*      CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPFLobbyInviteAccepted_ReturnValue;     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOnlineActivitySubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0168(0x0010)()
	bool                                          CallFunc_HasInviteOnly_ReturnValue;                // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_1;                       // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex_1;                   // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex_1;                  // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTutorialPopupDispFlag_ReturnValue;     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_5; // 0x0194(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStartGetDLCFreeContent_ReturnValue;     // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerSequence_ReturnValue_6;           // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_OnlineSequence_C*                   K2Node_DynamicCast_AsBP_Online_Sequence_2;         // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TopMenuSequence_C*                  K2Node_DynamicCast_AsBP_Top_Menu_Sequence_5;       // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGrandPrixLeast1Play_ReturnValue;        // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckDodonpaEventCondition_ReturnValue_1; // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonRaceMenuContentId                      CallFunc_GetLastSelectedRaceMenu_ReturnValue;      // 0x01CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFestaForceStart_isForceStart;           // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckDodonpaEventCondition_ReturnValue_2; // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x01D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIPopupWindowManager*             CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUnionUIPopupWindowBase*                CallFunc_CreatePopupWindow_ReturnValue;            // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface; // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_1; // 0x0208(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_2; // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_3; // 0x0238(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_4; // 0x0250(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMenuPopupWindowInterface> K2Node_DynamicCast_AsMenu_Popup_Window_Interface_5; // 0x0268(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_ApiName_2;                            // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_RequestData_2;                        // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_ResponseData_2;                       // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Error_2;                              // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckLoggedin_ReturnValue;                // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x02B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B3[0xD];                                      // 0x02B3(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x02C0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLocalDataFestaId_ReturnValue;          // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CommonConnectingUI_C*               CallFunc_FinishSpawningActor_ReturnValue;          // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerFestaPoint_ReturnValue;          // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendCheckCompensationRequest_OutSendSuccess; // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSendFestaEndResult_ReturnValue;         // 0x033D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33E[0x2];                                      // 0x033E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EUnionUIFadeDirection FadeDirection)> K2Node_CreateDelegate_OutputDelegate_6;     // 0x0340(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckLoggedin_ReturnValue_1;              // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0358(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0368(0x0010)()
	class FString                                 K2Node_Event_ApiName_1;                            // 0x0378(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_RequestData_1;                        // 0x0388(0x0010)(ZeroConstructor, HasGetValueTypeHash)
