#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_NoticePopup

#include "Basic.hpp"

#include "UnionUI_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPC_NoticePopup.BPC_NoticePopup_C.CheckFirstDisplayPage
// 0x0018 (0x0018 - 0x0000)
struct BPC_NoticePopup_C_CheckFirstDisplayPage final
{
public:
	ETopInfoWidgetPageCategory                    newParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNetMasterDataManageSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckLegendCompeStartNoticeDateTime_ReturnValue; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckLegendCompeStartDateTime_ReturnValue; // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_NoticePopup_C_CheckFirstDisplayPage) == 0x000008, "Wrong alignment on BPC_NoticePopup_C_CheckFirstDisplayPage");
static_assert(sizeof(BPC_NoticePopup_C_CheckFirstDisplayPage) == 0x000018, "Wrong size on BPC_NoticePopup_C_CheckFirstDisplayPage");
static_assert(offsetof(BPC_NoticePopup_C_CheckFirstDisplayPage, newParam) == 0x000000, "Member 'BPC_NoticePopup_C_CheckFirstDisplayPage::newParam' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_CheckFirstDisplayPage, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'BPC_NoticePopup_C_CheckFirstDisplayPage::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_CheckFirstDisplayPage, CallFunc_CheckLegendCompeStartNoticeDateTime_ReturnValue) == 0x000010, "Member 'BPC_NoticePopup_C_CheckFirstDisplayPage::CallFunc_CheckLegendCompeStartNoticeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_CheckFirstDisplayPage, CallFunc_Array_IsEmpty_ReturnValue) == 0x000011, "Member 'BPC_NoticePopup_C_CheckFirstDisplayPage::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_CheckFirstDisplayPage, CallFunc_CheckLegendCompeStartDateTime_ReturnValue) == 0x000012, "Member 'BPC_NoticePopup_C_CheckFirstDisplayPage::CallFunc_CheckLegendCompeStartDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_CheckFirstDisplayPage, CallFunc_BooleanOR_ReturnValue) == 0x000013, "Member 'BPC_NoticePopup_C_CheckFirstDisplayPage::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_CheckFirstDisplayPage, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000014, "Member 'BPC_NoticePopup_C_CheckFirstDisplayPage::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BPC_NoticePopup.BPC_NoticePopup_C.DLCInfoClosed_CreateTopInfo
// 0x0001 (0x0001 - 0x0000)
struct BPC_NoticePopup_C_DLCInfoClosed_CreateTopInfo final
{
public:
	bool                                          IsAccept;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_NoticePopup_C_DLCInfoClosed_CreateTopInfo) == 0x000001, "Wrong alignment on BPC_NoticePopup_C_DLCInfoClosed_CreateTopInfo");
static_assert(sizeof(BPC_NoticePopup_C_DLCInfoClosed_CreateTopInfo) == 0x000001, "Wrong size on BPC_NoticePopup_C_DLCInfoClosed_CreateTopInfo");
static_assert(offsetof(BPC_NoticePopup_C_DLCInfoClosed_CreateTopInfo, IsAccept) == 0x000000, "Member 'BPC_NoticePopup_C_DLCInfoClosed_CreateTopInfo::IsAccept' has a wrong offset!");

// Function BPC_NoticePopup.BPC_NoticePopup_C.ExecuteUbergraph_BPC_NoticePopup
// 0x0870 (0x0870 - 0x0000)
struct BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnionUIFadeDirection                         K2Node_CustomEvent_FadeDirection;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bWasSuccessful)>          K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0040(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ADLCStoreDialogActor*                   CallFunc_FinishSpawningActor_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNetMasterDataManageSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckFestaRankingCalcEnded_ReturnValue;   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReturnStatePreNotice_ReturnValue;       // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerSequence_ReturnValue;             // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALobbySquadSequence2*                   K2Node_DynamicCast_AsLobby_Squad_Sequence_2;       // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveDataManageSubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESaveDataStatus Status)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasSuccessful;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerSequence_ReturnValue_1;           // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ALobbySquadSequence2*                   K2Node_DynamicCast_AsLobby_Squad_Sequence_2_1;     // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuWorldSubsystem*                    CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool IsAccept)>                K2Node_CreateDelegate_OutputDelegate_5;            // 0x013C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsAccept;                       // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerSequence_ReturnValue_2;           // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATopMenuSequence*                       K2Node_DynamicCast_AsTop_Menu_Sequence;            // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETopInfoWidgetPageCategory                    CallFunc_CheckFirstDisplayPage_NewParam;           // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162[0xE];                                      // 0x0162(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0170(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_EventInfoManageActor_C*             CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNetMasterDataManageSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNetMasterDataManageSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckRaceDisableGadgetNotice_ReturnValue; // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckFreeContentNotice_ReturnValue;       // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2[0x6];                                      // 0x01F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetActiveFreeContentNoticeInfo_NoticeID;  // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_GetActiveFreeContentNoticeInfo_ReleaseTime; // 0x0208(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_GetActiveFreeContentNoticeInfo_LaunchNoticeTime; // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActiveFreeContentNoticeInfo_ReturnValue; // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsExistsRaceDisableGadgetsAny_ReturnValue; // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A[0x2];                                      // 0x021A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x021C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNetMasterDataManageSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLegendCompeId_ReturnValue;             // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckLegendCompeNotice_ReturnValue;       // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0235(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_236[0x2];                                      // 0x0236(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAppDataManageSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_UtcNow_ReturnValue;                       // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLegendForceStart_ReturnValue;           // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BreakDateTime_Year;                       // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month;                      // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day;                        // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour;                       // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute;                     // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second;                     // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond;                // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_MakeDateTime_ReturnValue;                 // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNetMasterDataManageSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_6;   // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_GetEventEndUTCTime_ReturnValue;           // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_GetEventStartUTCTime_ReturnValue;         // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0290(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_As_______;                      // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventInfoManageActor_C*             CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0310(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNetMasterDataManageSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_7;   // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFirstFestaEnded_ReturnValue;            // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_As________1;                    // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMasterDataManageSubsystem*             CallFunc_GetGameInstanceSubsystem_ReturnValue_8;   // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_3;              // 0x0350(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3; // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EventInfoManageActor_C*             CallFunc_FinishSpawningActor_ReturnValue_3;        // 0x03C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFestaUIDataAsset*                      K2Node_DynamicCast_AsFesta_UIData_Asset;           // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x03D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFestaUIData_bFoundData;                // 0x03D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D3[0x5];                                      // 0x03D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFestaUIData                           CallFunc_GetFestaUIData_FestaUIData;               // 0x03D8(0x0168)()
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_2;         // 0x0540(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_As_____2D;                      // 0x0548(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_551[0x3];                                      // 0x0551(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetFestaIdUtil_ReturnValue;               // 0x0554(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFestaForceStart_IsDebugStart;           // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_559[0x7];                                      // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0560(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_569[0x7];                                      // 0x0569(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller_1;      // 0x0570(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0579(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57A[0x6];                                      // 0x057A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNetMasterDataManageSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_9;   // 0x0580(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckFestaNotice_ReturnValue;             // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_589[0x3];                                      // 0x0589(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x058C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceNextSequenceManagerSubsytem*      CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0590(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNetMasterDataManageSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_10;  // 0x0598(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckDLCNotice_ReturnValue;               // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x05A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnregisterMainMenu_ReturnValue;           // 0x05A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x05A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A4[0x4];                                      // 0x05A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_3;         // 0x05A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             K2Node_DynamicCast_As________2;                    // 0x05B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B9[0x3];                                      // 0x05B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x05BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDlcUITableRowData                     CallFunc_GetDataTableRowFromName_OutRow;           // 0x05C0(0x0058)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_619[0x7];                                      // 0x0619(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAppDataManageSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_11;  // 0x0620(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_getDebugDLCId_ReturnValue;                // 0x0628(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62C[0x4];                                      // 0x062C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0630(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_4;         // 0x0640(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0648(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_As_____2D_1;                    // 0x0650(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_659[0x7];                                      // 0x0659(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDlcUITableRowData                     CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0660(0x0058)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x06B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B9[0x7];                                      // 0x06B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_5;         // 0x06C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_As_____2D_2;                    // 0x06C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D1[0x7];                                      // 0x06D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UForceNextSequenceManagerSubsytem*      CallFunc_GetWorldSubsystem_ReturnValue_2;          // 0x06D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppDataManageSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_12;  // 0x06E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFriendSubsystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_13;  // 0x06E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDLCNoticeForceSet_ReturnValue;          // 0x06F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x06F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F2[0x2];                                      // 0x06F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EUnionUIFadeDirection FadeDirection)> K2Node_CreateDelegate_OutputDelegate_6;     // 0x06F4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0704(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_714[0x4];                                      // 0x0714(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNetMasterDataManageSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_14;  // 0x0718(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0720(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetActiveDLCNoticeInfo_NoticeID;          // 0x0730(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_GetActiveDLCNoticeInfo_DLCReleaseTime;    // 0x0740(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActiveDLCNoticeInfo_ReturnValue;       // 0x0748(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_749[0x7];                                      // 0x0749(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_TopInfo_C*                         CallFunc_Create_ReturnValue;                       // 0x0750(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0758(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_759[0x3];                                      // 0x0759(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x075C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_764[0x4];                                      // 0x0764(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDlcUITableRowData                     CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x0768(0x0058)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C1[0x3];                                      // 0x07C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x07C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D4[0x4];                                      // 0x07D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_6;         // 0x07D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_As_____2D_3;                    // 0x07E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x07E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E9[0x3];                                      // 0x07E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x07EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x07FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7FD[0x3];                                      // 0x07FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x0800(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0810(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_811[0x7];                                      // 0x0811(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUITransitionManager*              CallFunc_GetGameInstanceSubsystem_ReturnValue_15;  // 0x0818(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESaveDataStatus                               K2Node_CustomEvent_Status;                         // 0x0820(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0821(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0822(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSetFinalResultFestaRanking_ReturnValue; // 0x0823(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0824(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_ApiName;                              // 0x0828(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_RequestData;                          // 0x0838(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_ResponseData;                         // 0x0848(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Error;                                // 0x0858(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_859[0x3];                                      // 0x0859(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetFestaIdUtil_ReturnValue_1;             // 0x085C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFestaCheckFestaRewardRequest          K2Node_MakeStruct_FestaCheckFestaRewardRequest;    // 0x0860(0x0004)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0864(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup) == 0x000010, "Wrong alignment on BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup");
static_assert(sizeof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup) == 0x000870, "Wrong size on BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, EntryPoint) == 0x000000, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, K2Node_CustomEvent_FadeDirection) == 0x000004, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::K2Node_CustomEvent_FadeDirection' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, K2Node_DynamicCast_AsApp_Player_Controller) == 0x000020, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_MakeTransform_ReturnValue) == 0x000040, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000A0, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000A8, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000B0, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000C0, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000D0, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_CheckFestaRankingCalcEnded_ReturnValue) == 0x0000D8, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_CheckFestaRankingCalcEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_IsReturnStatePreNotice_ReturnValue) == 0x0000D9, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_IsReturnStatePreNotice_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_GetOwnerSequence_ReturnValue) == 0x0000E0, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_GetOwnerSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, K2Node_DynamicCast_AsLobby_Squad_Sequence_2) == 0x0000E8, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::K2Node_DynamicCast_AsLobby_Squad_Sequence_2' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, K2Node_DynamicCast_bSuccess_1) == 0x0000F0, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0000F8, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, K2Node_CreateDelegate_OutputDelegate_4) == 0x000100, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, K2Node_Event_bWasSuccessful) == 0x000110, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::K2Node_Event_bWasSuccessful' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_GetOwnerSequence_ReturnValue_1) == 0x000118, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_GetOwnerSequence_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, K2Node_DynamicCast_AsLobby_Squad_Sequence_2_1) == 0x000120, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::K2Node_DynamicCast_AsLobby_Squad_Sequence_2_1' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, K2Node_DynamicCast_bSuccess_2) == 0x000128, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_GetWorldSubsystem_ReturnValue) == 0x000130, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_IsValid_ReturnValue) == 0x000138, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, K2Node_CreateDelegate_OutputDelegate_5) == 0x00013C, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, K2Node_CustomEvent_IsAccept) == 0x00014C, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::K2Node_CustomEvent_IsAccept' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_GetOwnerSequence_ReturnValue_2) == 0x000150, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_GetOwnerSequence_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, K2Node_DynamicCast_AsTop_Menu_Sequence) == 0x000158, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::K2Node_DynamicCast_AsTop_Menu_Sequence' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, K2Node_DynamicCast_bSuccess_3) == 0x000160, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_CheckFirstDisplayPage_NewParam) == 0x000161, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_CheckFirstDisplayPage_NewParam' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_MakeTransform_ReturnValue_1) == 0x000170, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0001D0, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0001D8, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x0001E0, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x0001E8, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_CheckRaceDisableGadgetNotice_ReturnValue) == 0x0001F0, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_CheckRaceDisableGadgetNotice_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_CheckFreeContentNotice_ReturnValue) == 0x0001F1, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_CheckFreeContentNotice_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_GetActiveFreeContentNoticeInfo_NoticeID) == 0x0001F8, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_GetActiveFreeContentNoticeInfo_NoticeID' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_GetActiveFreeContentNoticeInfo_ReleaseTime) == 0x000208, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_GetActiveFreeContentNoticeInfo_ReleaseTime' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_GetActiveFreeContentNoticeInfo_LaunchNoticeTime) == 0x000210, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_GetActiveFreeContentNoticeInfo_LaunchNoticeTime' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_GetActiveFreeContentNoticeInfo_ReturnValue) == 0x000218, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_GetActiveFreeContentNoticeInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_IsExistsRaceDisableGadgetsAny_ReturnValue) == 0x000219, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_IsExistsRaceDisableGadgetsAny_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_Conv_StringToName_ReturnValue) == 0x00021C, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x000228, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_GetLegendCompeId_ReturnValue) == 0x000230, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_GetLegendCompeId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_CheckLegendCompeNotice_ReturnValue) == 0x000234, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_CheckLegendCompeNotice_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_Greater_IntInt_ReturnValue) == 0x000235, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x000238, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_UtcNow_ReturnValue) == 0x000240, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_UtcNow_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_IsLegendForceStart_ReturnValue) == 0x000248, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_IsLegendForceStart_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_BreakDateTime_Year) == 0x00024C, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_BreakDateTime_Year' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_BreakDateTime_Month) == 0x000250, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_BreakDateTime_Month' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_BreakDateTime_Day) == 0x000254, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_BreakDateTime_Day' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_BreakDateTime_Hour) == 0x000258, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_BreakDateTime_Hour' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_BreakDateTime_Minute) == 0x00025C, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_BreakDateTime_Minute' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_BreakDateTime_Second) == 0x000260, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_BreakDateTime_Second' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_BreakDateTime_Millisecond) == 0x000264, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_BreakDateTime_Millisecond' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_BooleanOR_ReturnValue) == 0x000268, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_MakeDateTime_ReturnValue) == 0x000270, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_MakeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_GetGameInstanceSubsystem_ReturnValue_6) == 0x000278, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_GetGameInstanceSubsystem_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_GetEventEndUTCTime_ReturnValue) == 0x000280, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_GetEventEndUTCTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_GetEventStartUTCTime_ReturnValue) == 0x000288, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_GetEventStartUTCTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_MakeTransform_ReturnValue_2) == 0x000290, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_MakeTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x0002F0, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x0002F8, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, K2Node_DynamicCast_As_______) == 0x000300, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::K2Node_DynamicCast_As_______' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, K2Node_DynamicCast_bSuccess_4) == 0x000308, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000310, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_GetGameInstanceSubsystem_ReturnValue_7) == 0x000318, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_GetGameInstanceSubsystem_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_IsFirstFestaEnded_ReturnValue) == 0x000320, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_IsFirstFestaEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_LoadAsset_Blocking_ReturnValue_1) == 0x000328, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_LoadAsset_Blocking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, K2Node_DynamicCast_As________1) == 0x000330, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::K2Node_DynamicCast_As________1' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, K2Node_DynamicCast_bSuccess_5) == 0x000338, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_GetGameInstanceSubsystem_ReturnValue_8) == 0x000340, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_GetGameInstanceSubsystem_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup, CallFunc_MakeTransform_ReturnValue_3) == 0x000350, "Member 'BPC_NoticePopup_C_ExecuteUbergraph_BPC_NoticePopup::CallFunc_MakeTransform_ReturnValue_3' has a wrong offset!");
