#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Race_Sub_Btn_Option

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "InputCore_structs.hpp"
#include "UnionRun_structs.hpp"


namespace SDK::Params
{

// Function WBP_Race_Sub_Btn_Option.WBP_Race_Sub_Btn_Option_C.ExecuteUbergraph_WBP_Race_Sub_Btn_Option
// 0x0038 (0x0038 - 0x0000)
struct WBP_Race_Sub_Btn_Option_C_ExecuteUbergraph_WBP_Race_Sub_Btn_Option final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InValue;                              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_Sub_Btn_Option_C_ExecuteUbergraph_WBP_Race_Sub_Btn_Option) == 0x000008, "Wrong alignment on WBP_Race_Sub_Btn_Option_C_ExecuteUbergraph_WBP_Race_Sub_Btn_Option");
static_assert(sizeof(WBP_Race_Sub_Btn_Option_C_ExecuteUbergraph_WBP_Race_Sub_Btn_Option) == 0x000038, "Wrong size on WBP_Race_Sub_Btn_Option_C_ExecuteUbergraph_WBP_Race_Sub_Btn_Option");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_ExecuteUbergraph_WBP_Race_Sub_Btn_Option, EntryPoint) == 0x000000, "Member 'WBP_Race_Sub_Btn_Option_C_ExecuteUbergraph_WBP_Race_Sub_Btn_Option::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_ExecuteUbergraph_WBP_Race_Sub_Btn_Option, K2Node_Event_InValue) == 0x000004, "Member 'WBP_Race_Sub_Btn_Option_C_ExecuteUbergraph_WBP_Race_Sub_Btn_Option::K2Node_Event_InValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_ExecuteUbergraph_WBP_Race_Sub_Btn_Option, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000008, "Member 'WBP_Race_Sub_Btn_Option_C_ExecuteUbergraph_WBP_Race_Sub_Btn_Option::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_ExecuteUbergraph_WBP_Race_Sub_Btn_Option, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WBP_Race_Sub_Btn_Option_C_ExecuteUbergraph_WBP_Race_Sub_Btn_Option::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_ExecuteUbergraph_WBP_Race_Sub_Btn_Option, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000018, "Member 'WBP_Race_Sub_Btn_Option_C_ExecuteUbergraph_WBP_Race_Sub_Btn_Option::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_ExecuteUbergraph_WBP_Race_Sub_Btn_Option, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000019, "Member 'WBP_Race_Sub_Btn_Option_C_ExecuteUbergraph_WBP_Race_Sub_Btn_Option::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_ExecuteUbergraph_WBP_Race_Sub_Btn_Option, CallFunc_NotEqual_ObjectObject_ReturnValue_1) == 0x00001A, "Member 'WBP_Race_Sub_Btn_Option_C_ExecuteUbergraph_WBP_Race_Sub_Btn_Option::CallFunc_NotEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_ExecuteUbergraph_WBP_Race_Sub_Btn_Option, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'WBP_Race_Sub_Btn_Option_C_ExecuteUbergraph_WBP_Race_Sub_Btn_Option::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_ExecuteUbergraph_WBP_Race_Sub_Btn_Option, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x000028, "Member 'WBP_Race_Sub_Btn_Option_C_ExecuteUbergraph_WBP_Race_Sub_Btn_Option::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_ExecuteUbergraph_WBP_Race_Sub_Btn_Option, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000030, "Member 'WBP_Race_Sub_Btn_Option_C_ExecuteUbergraph_WBP_Race_Sub_Btn_Option::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_Race_Sub_Btn_Option.WBP_Race_Sub_Btn_Option_C.OnAccelInput
// 0x0004 (0x0004 - 0x0000)
struct WBP_Race_Sub_Btn_Option_C_OnAccelInput final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_Sub_Btn_Option_C_OnAccelInput) == 0x000004, "Wrong alignment on WBP_Race_Sub_Btn_Option_C_OnAccelInput");
static_assert(sizeof(WBP_Race_Sub_Btn_Option_C_OnAccelInput) == 0x000004, "Wrong size on WBP_Race_Sub_Btn_Option_C_OnAccelInput");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_OnAccelInput, InValue) == 0x000000, "Member 'WBP_Race_Sub_Btn_Option_C_OnAccelInput::InValue' has a wrong offset!");

// Function WBP_Race_Sub_Btn_Option.WBP_Race_Sub_Btn_Option_C.SetKey
// 0x0158 (0x0158 - 0x0000)
struct WBP_Race_Sub_Btn_Option_C_SetKey final
{
public:
	struct FKey                                   NewKey;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	int32                                         PlayerControllerIndex;                             // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSuccess;                                         // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBtnGuidePlatFormController                   CallFunc_GetControllerType_ReturnValue;            // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBtnGuidePlatFormController                   CallFunc_GetControllerType_ReturnValue_1;          // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue_1;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBtnGuidePlatformText                  CallFunc_GetDataTableRowFromName_OutRow;           // 0x0030(0x0068)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBtnGuidePlatformText                  CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x00A0(0x0068)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EControllerButtonTextureType                  CallFunc_GetControllerButtonTextureType_ReturnValue; // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EControllerButtonTextureType                  CallFunc_GetControllerButtonTextureType_ReturnValue_1; // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x010E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_2;          // 0x010F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_3;          // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_3;         // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_4;         // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_5;         // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_6;         // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_7;         // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Race_Sub_Btn_Option_C_SetKey) == 0x000008, "Wrong alignment on WBP_Race_Sub_Btn_Option_C_SetKey");
static_assert(sizeof(WBP_Race_Sub_Btn_Option_C_SetKey) == 0x000158, "Wrong size on WBP_Race_Sub_Btn_Option_C_SetKey");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_SetKey, NewKey) == 0x000000, "Member 'WBP_Race_Sub_Btn_Option_C_SetKey::NewKey' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_SetKey, PlayerControllerIndex) == 0x000018, "Member 'WBP_Race_Sub_Btn_Option_C_SetKey::PlayerControllerIndex' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_SetKey, IsSuccess) == 0x00001C, "Member 'WBP_Race_Sub_Btn_Option_C_SetKey::IsSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_SetKey, CallFunc_GetControllerType_ReturnValue) == 0x00001D, "Member 'WBP_Race_Sub_Btn_Option_C_SetKey::CallFunc_GetControllerType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_SetKey, CallFunc_GetControllerType_ReturnValue_1) == 0x00001E, "Member 'WBP_Race_Sub_Btn_Option_C_SetKey::CallFunc_GetControllerType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_SetKey, CallFunc_GetEnumeratorName_ReturnValue) == 0x000020, "Member 'WBP_Race_Sub_Btn_Option_C_SetKey::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_SetKey, CallFunc_GetEnumeratorName_ReturnValue_1) == 0x000028, "Member 'WBP_Race_Sub_Btn_Option_C_SetKey::CallFunc_GetEnumeratorName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_SetKey, CallFunc_GetDataTableRowFromName_OutRow) == 0x000030, "Member 'WBP_Race_Sub_Btn_Option_C_SetKey::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_SetKey, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000098, "Member 'WBP_Race_Sub_Btn_Option_C_SetKey::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_SetKey, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0000A0, "Member 'WBP_Race_Sub_Btn_Option_C_SetKey::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_SetKey, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000108, "Member 'WBP_Race_Sub_Btn_Option_C_SetKey::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_SetKey, CallFunc_GetControllerButtonTextureType_ReturnValue) == 0x000109, "Member 'WBP_Race_Sub_Btn_Option_C_SetKey::CallFunc_GetControllerButtonTextureType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_SetKey, K2Node_SwitchEnum_CmpSuccess) == 0x00010A, "Member 'WBP_Race_Sub_Btn_Option_C_SetKey::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_SetKey, CallFunc_GetControllerButtonTextureType_ReturnValue_1) == 0x00010B, "Member 'WBP_Race_Sub_Btn_Option_C_SetKey::CallFunc_GetControllerButtonTextureType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_SetKey, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x00010C, "Member 'WBP_Race_Sub_Btn_Option_C_SetKey::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_SetKey, K2Node_SwitchEnum_CmpSuccess_1) == 0x00010D, "Member 'WBP_Race_Sub_Btn_Option_C_SetKey::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_SetKey, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x00010E, "Member 'WBP_Race_Sub_Btn_Option_C_SetKey::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_SetKey, CallFunc_EqualEqual_KeyKey_ReturnValue_2) == 0x00010F, "Member 'WBP_Race_Sub_Btn_Option_C_SetKey::CallFunc_EqualEqual_KeyKey_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_SetKey, CallFunc_EqualEqual_KeyKey_ReturnValue_3) == 0x000110, "Member 'WBP_Race_Sub_Btn_Option_C_SetKey::CallFunc_EqualEqual_KeyKey_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_SetKey, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000118, "Member 'WBP_Race_Sub_Btn_Option_C_SetKey::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_SetKey, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000120, "Member 'WBP_Race_Sub_Btn_Option_C_SetKey::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_SetKey, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000128, "Member 'WBP_Race_Sub_Btn_Option_C_SetKey::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_SetKey, CallFunc_GetDynamicMaterial_ReturnValue_3) == 0x000130, "Member 'WBP_Race_Sub_Btn_Option_C_SetKey::CallFunc_GetDynamicMaterial_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_SetKey, CallFunc_GetDynamicMaterial_ReturnValue_4) == 0x000138, "Member 'WBP_Race_Sub_Btn_Option_C_SetKey::CallFunc_GetDynamicMaterial_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_SetKey, CallFunc_GetDynamicMaterial_ReturnValue_5) == 0x000140, "Member 'WBP_Race_Sub_Btn_Option_C_SetKey::CallFunc_GetDynamicMaterial_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_SetKey, CallFunc_GetDynamicMaterial_ReturnValue_6) == 0x000148, "Member 'WBP_Race_Sub_Btn_Option_C_SetKey::CallFunc_GetDynamicMaterial_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Race_Sub_Btn_Option_C_SetKey, CallFunc_GetDynamicMaterial_ReturnValue_7) == 0x000150, "Member 'WBP_Race_Sub_Btn_Option_C_SetKey::CallFunc_GetDynamicMaterial_ReturnValue_7' has a wrong offset!");

}

