#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Friend_Sub_AddFriend

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UnionUI_structs.hpp"
#include "UNION_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Friend_Sub_AddFriend.WBP_Friend_Sub_AddFriend_C.GetNumberInputWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Friend_Sub_AddFriend_C_GetNumberInputWidget final
{
public:
	class UFriendListNumberInputWidget*           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_AddFriend_C_GetNumberInputWidget) == 0x000008, "Wrong alignment on WBP_Friend_Sub_AddFriend_C_GetNumberInputWidget");
static_assert(sizeof(WBP_Friend_Sub_AddFriend_C_GetNumberInputWidget) == 0x000008, "Wrong size on WBP_Friend_Sub_AddFriend_C_GetNumberInputWidget");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_GetNumberInputWidget, ReturnValue) == 0x000000, "Member 'WBP_Friend_Sub_AddFriend_C_GetNumberInputWidget::ReturnValue' has a wrong offset!");

// Function WBP_Friend_Sub_AddFriend.WBP_Friend_Sub_AddFriend_C.OnFocusReceived
// 0x01C0 (0x01C0 - 0x0000)
struct WBP_Friend_Sub_AddFriend_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x00F8(0x00B8)()
	int32                                         CallFunc_GetUserIndexByFocusEvent_ReturnValue;     // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_AddFriend_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_Friend_Sub_AddFriend_C_OnFocusReceived");
static_assert(sizeof(WBP_Friend_Sub_AddFriend_C_OnFocusReceived) == 0x0001C0, "Wrong size on WBP_Friend_Sub_AddFriend_C_OnFocusReceived");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_Friend_Sub_AddFriend_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_Friend_Sub_AddFriend_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_Friend_Sub_AddFriend_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_OnFocusReceived, K2Node_MakeStruct_EventReply) == 0x0000F8, "Member 'WBP_Friend_Sub_AddFriend_C_OnFocusReceived::K2Node_MakeStruct_EventReply' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_OnFocusReceived, CallFunc_GetUserIndexByFocusEvent_ReturnValue) == 0x0001B0, "Member 'WBP_Friend_Sub_AddFriend_C_OnFocusReceived::CallFunc_GetUserIndexByFocusEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_OnFocusReceived, CallFunc_GetPlayerController_ReturnValue) == 0x0001B8, "Member 'WBP_Friend_Sub_AddFriend_C_OnFocusReceived::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

// Function WBP_Friend_Sub_AddFriend.WBP_Friend_Sub_AddFriend_C.GetScrollBoxWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_Friend_Sub_AddFriend_C_GetScrollBoxWidget final
{
public:
	class UScrollBox*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_AddFriend_C_GetScrollBoxWidget) == 0x000008, "Wrong alignment on WBP_Friend_Sub_AddFriend_C_GetScrollBoxWidget");
static_assert(sizeof(WBP_Friend_Sub_AddFriend_C_GetScrollBoxWidget) == 0x000008, "Wrong size on WBP_Friend_Sub_AddFriend_C_GetScrollBoxWidget");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_GetScrollBoxWidget, ReturnValue) == 0x000000, "Member 'WBP_Friend_Sub_AddFriend_C_GetScrollBoxWidget::ReturnValue' has a wrong offset!");

// Function WBP_Friend_Sub_AddFriend.WBP_Friend_Sub_AddFriend_C.OnListItemDecisionDown
// 0x0008 (0x0008 - 0x0000)
struct WBP_Friend_Sub_AddFriend_C_OnListItemDecisionDown final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_AddFriend_C_OnListItemDecisionDown) == 0x000008, "Wrong alignment on WBP_Friend_Sub_AddFriend_C_OnListItemDecisionDown");
static_assert(sizeof(WBP_Friend_Sub_AddFriend_C_OnListItemDecisionDown) == 0x000008, "Wrong size on WBP_Friend_Sub_AddFriend_C_OnListItemDecisionDown");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_OnListItemDecisionDown, Button) == 0x000000, "Member 'WBP_Friend_Sub_AddFriend_C_OnListItemDecisionDown::Button' has a wrong offset!");

// Function WBP_Friend_Sub_AddFriend.WBP_Friend_Sub_AddFriend_C.SetupListItemWidgetSingle
// 0x0100 (0x0100 - 0x0000)
struct WBP_Friend_Sub_AddFriend_C_SetupListItemWidgetSingle final
{
public:
	class UWBP_Friend_Sub_PlayerPlate_Small_C*    InItemListWidget;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFriendListPlayerInfo                  InListPlayerInfo;                                  // 0x0008(0x00F0)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         InButtonIndex;                                     // 0x00F8(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_AddFriend_C_SetupListItemWidgetSingle) == 0x000008, "Wrong alignment on WBP_Friend_Sub_AddFriend_C_SetupListItemWidgetSingle");
static_assert(sizeof(WBP_Friend_Sub_AddFriend_C_SetupListItemWidgetSingle) == 0x000100, "Wrong size on WBP_Friend_Sub_AddFriend_C_SetupListItemWidgetSingle");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_SetupListItemWidgetSingle, InItemListWidget) == 0x000000, "Member 'WBP_Friend_Sub_AddFriend_C_SetupListItemWidgetSingle::InItemListWidget' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_SetupListItemWidgetSingle, InListPlayerInfo) == 0x000008, "Member 'WBP_Friend_Sub_AddFriend_C_SetupListItemWidgetSingle::InListPlayerInfo' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_SetupListItemWidgetSingle, InButtonIndex) == 0x0000F8, "Member 'WBP_Friend_Sub_AddFriend_C_SetupListItemWidgetSingle::InButtonIndex' has a wrong offset!");

// Function WBP_Friend_Sub_AddFriend.WBP_Friend_Sub_AddFriend_C.OnListItemCancelDown
// 0x0008 (0x0008 - 0x0000)
struct WBP_Friend_Sub_AddFriend_C_OnListItemCancelDown final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_AddFriend_C_OnListItemCancelDown) == 0x000008, "Wrong alignment on WBP_Friend_Sub_AddFriend_C_OnListItemCancelDown");
static_assert(sizeof(WBP_Friend_Sub_AddFriend_C_OnListItemCancelDown) == 0x000008, "Wrong size on WBP_Friend_Sub_AddFriend_C_OnListItemCancelDown");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_OnListItemCancelDown, Button) == 0x000000, "Member 'WBP_Friend_Sub_AddFriend_C_OnListItemCancelDown::Button' has a wrong offset!");

// Function WBP_Friend_Sub_AddFriend.WBP_Friend_Sub_AddFriend_C.FocusListItemWidget
// 0x0001 (0x0001 - 0x0000)
struct WBP_Friend_Sub_AddFriend_C_FocusListItemWidget final
{
public:
	bool                                          bInPlayFocusSound;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_AddFriend_C_FocusListItemWidget) == 0x000001, "Wrong alignment on WBP_Friend_Sub_AddFriend_C_FocusListItemWidget");
static_assert(sizeof(WBP_Friend_Sub_AddFriend_C_FocusListItemWidget) == 0x000001, "Wrong size on WBP_Friend_Sub_AddFriend_C_FocusListItemWidget");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_FocusListItemWidget, bInPlayFocusSound) == 0x000000, "Member 'WBP_Friend_Sub_AddFriend_C_FocusListItemWidget::bInPlayFocusSound' has a wrong offset!");

// Function WBP_Friend_Sub_AddFriend.WBP_Friend_Sub_AddFriend_C.OnButtonDecisionEvent
// 0x0008 (0x0008 - 0x0000)
struct WBP_Friend_Sub_AddFriend_C_OnButtonDecisionEvent final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_AddFriend_C_OnButtonDecisionEvent) == 0x000008, "Wrong alignment on WBP_Friend_Sub_AddFriend_C_OnButtonDecisionEvent");
static_assert(sizeof(WBP_Friend_Sub_AddFriend_C_OnButtonDecisionEvent) == 0x000008, "Wrong size on WBP_Friend_Sub_AddFriend_C_OnButtonDecisionEvent");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_OnButtonDecisionEvent, Button) == 0x000000, "Member 'WBP_Friend_Sub_AddFriend_C_OnButtonDecisionEvent::Button' has a wrong offset!");

// Function WBP_Friend_Sub_AddFriend.WBP_Friend_Sub_AddFriend_C.OnNumberInputWidgetDecision
// 0x0010 (0x0010 - 0x0000)
struct WBP_Friend_Sub_AddFriend_C_OnNumberInputWidgetDecision final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         PanelIndex;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_AddFriend_C_OnNumberInputWidgetDecision) == 0x000008, "Wrong alignment on WBP_Friend_Sub_AddFriend_C_OnNumberInputWidgetDecision");
static_assert(sizeof(WBP_Friend_Sub_AddFriend_C_OnNumberInputWidgetDecision) == 0x000010, "Wrong size on WBP_Friend_Sub_AddFriend_C_OnNumberInputWidgetDecision");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_OnNumberInputWidgetDecision, Button) == 0x000000, "Member 'WBP_Friend_Sub_AddFriend_C_OnNumberInputWidgetDecision::Button' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_OnNumberInputWidgetDecision, PanelIndex) == 0x000008, "Member 'WBP_Friend_Sub_AddFriend_C_OnNumberInputWidgetDecision::PanelIndex' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_OnNumberInputWidgetDecision, ButtonIndex) == 0x00000C, "Member 'WBP_Friend_Sub_AddFriend_C_OnNumberInputWidgetDecision::ButtonIndex' has a wrong offset!");

// Function WBP_Friend_Sub_AddFriend.WBP_Friend_Sub_AddFriend_C.OnUserSearchSuccess
// 0x0010 (0x0010 - 0x0000)
struct WBP_Friend_Sub_AddFriend_C_OnUserSearchSuccess final
{
public:
	TArray<struct FCommon_UserSearchData>         InUserSearchData;                                  // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Friend_Sub_AddFriend_C_OnUserSearchSuccess) == 0x000008, "Wrong alignment on WBP_Friend_Sub_AddFriend_C_OnUserSearchSuccess");
static_assert(sizeof(WBP_Friend_Sub_AddFriend_C_OnUserSearchSuccess) == 0x000010, "Wrong size on WBP_Friend_Sub_AddFriend_C_OnUserSearchSuccess");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_OnUserSearchSuccess, InUserSearchData) == 0x000000, "Member 'WBP_Friend_Sub_AddFriend_C_OnUserSearchSuccess::InUserSearchData' has a wrong offset!");

// Function WBP_Friend_Sub_AddFriend.WBP_Friend_Sub_AddFriend_C.ExecuteAfterConfirmWidget
// 0x000C (0x000C - 0x0000)
struct WBP_Friend_Sub_AddFriend_C_ExecuteAfterConfirmWidget final
{
public:
	EFriendListCommandType                        CommandType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InButtonIndex;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInCanceled;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_AddFriend_C_ExecuteAfterConfirmWidget) == 0x000004, "Wrong alignment on WBP_Friend_Sub_AddFriend_C_ExecuteAfterConfirmWidget");
static_assert(sizeof(WBP_Friend_Sub_AddFriend_C_ExecuteAfterConfirmWidget) == 0x00000C, "Wrong size on WBP_Friend_Sub_AddFriend_C_ExecuteAfterConfirmWidget");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_ExecuteAfterConfirmWidget, CommandType) == 0x000000, "Member 'WBP_Friend_Sub_AddFriend_C_ExecuteAfterConfirmWidget::CommandType' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_ExecuteAfterConfirmWidget, InButtonIndex) == 0x000004, "Member 'WBP_Friend_Sub_AddFriend_C_ExecuteAfterConfirmWidget::InButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_ExecuteAfterConfirmWidget, bInCanceled) == 0x000008, "Member 'WBP_Friend_Sub_AddFriend_C_ExecuteAfterConfirmWidget::bInCanceled' has a wrong offset!");

// Function WBP_Friend_Sub_AddFriend.WBP_Friend_Sub_AddFriend_C.AddListItemWidgetByListItemIndex
// 0x0004 (0x0004 - 0x0000)
struct WBP_Friend_Sub_AddFriend_C_AddListItemWidgetByListItemIndex final
{
public:
	int32                                         InListItemIndex;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_AddFriend_C_AddListItemWidgetByListItemIndex) == 0x000004, "Wrong alignment on WBP_Friend_Sub_AddFriend_C_AddListItemWidgetByListItemIndex");
static_assert(sizeof(WBP_Friend_Sub_AddFriend_C_AddListItemWidgetByListItemIndex) == 0x000004, "Wrong size on WBP_Friend_Sub_AddFriend_C_AddListItemWidgetByListItemIndex");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_AddListItemWidgetByListItemIndex, InListItemIndex) == 0x000000, "Member 'WBP_Friend_Sub_AddFriend_C_AddListItemWidgetByListItemIndex::InListItemIndex' has a wrong offset!");

// Function WBP_Friend_Sub_AddFriend.WBP_Friend_Sub_AddFriend_C.SetButtonControlEnable
// 0x0001 (0x0001 - 0x0000)
struct WBP_Friend_Sub_AddFriend_C_SetButtonControlEnable final
{
public:
	bool                                          bInEnable;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_AddFriend_C_SetButtonControlEnable) == 0x000001, "Wrong alignment on WBP_Friend_Sub_AddFriend_C_SetButtonControlEnable");
static_assert(sizeof(WBP_Friend_Sub_AddFriend_C_SetButtonControlEnable) == 0x000001, "Wrong size on WBP_Friend_Sub_AddFriend_C_SetButtonControlEnable");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_SetButtonControlEnable, bInEnable) == 0x000000, "Member 'WBP_Friend_Sub_AddFriend_C_SetButtonControlEnable::bInEnable' has a wrong offset!");

// Function WBP_Friend_Sub_AddFriend.WBP_Friend_Sub_AddFriend_C.SetWidgetFocus
// 0x0010 (0x0010 - 0x0000)
struct WBP_Friend_Sub_AddFriend_C_SetWidgetFocus final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bInPlayFocusSound;                                 // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_AddFriend_C_SetWidgetFocus) == 0x000008, "Wrong alignment on WBP_Friend_Sub_AddFriend_C_SetWidgetFocus");
static_assert(sizeof(WBP_Friend_Sub_AddFriend_C_SetWidgetFocus) == 0x000010, "Wrong size on WBP_Friend_Sub_AddFriend_C_SetWidgetFocus");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_SetWidgetFocus, PlayerController) == 0x000000, "Member 'WBP_Friend_Sub_AddFriend_C_SetWidgetFocus::PlayerController' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_SetWidgetFocus, bInPlayFocusSound) == 0x000008, "Member 'WBP_Friend_Sub_AddFriend_C_SetWidgetFocus::bInPlayFocusSound' has a wrong offset!");

// Function WBP_Friend_Sub_AddFriend.WBP_Friend_Sub_AddFriend_C.SetListItemWidgetInteractableState
// 0x0001 (0x0001 - 0x0000)
struct WBP_Friend_Sub_AddFriend_C_SetListItemWidgetInteractableState final
{
public:
	bool                                          bInEnable;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_AddFriend_C_SetListItemWidgetInteractableState) == 0x000001, "Wrong alignment on WBP_Friend_Sub_AddFriend_C_SetListItemWidgetInteractableState");
static_assert(sizeof(WBP_Friend_Sub_AddFriend_C_SetListItemWidgetInteractableState) == 0x000001, "Wrong size on WBP_Friend_Sub_AddFriend_C_SetListItemWidgetInteractableState");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_SetListItemWidgetInteractableState, bInEnable) == 0x000000, "Member 'WBP_Friend_Sub_AddFriend_C_SetListItemWidgetInteractableState::bInEnable' has a wrong offset!");

// Function WBP_Friend_Sub_AddFriend.WBP_Friend_Sub_AddFriend_C.SetListItemWidgetButtonChangeableState
// 0x0008 (0x0008 - 0x0000)
struct WBP_Friend_Sub_AddFriend_C_SetListItemWidgetButtonChangeableState final
{
public:
	int32                                         InListItemIndex;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnable;                                           // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_AddFriend_C_SetListItemWidgetButtonChangeableState) == 0x000004, "Wrong alignment on WBP_Friend_Sub_AddFriend_C_SetListItemWidgetButtonChangeableState");
static_assert(sizeof(WBP_Friend_Sub_AddFriend_C_SetListItemWidgetButtonChangeableState) == 0x000008, "Wrong size on WBP_Friend_Sub_AddFriend_C_SetListItemWidgetButtonChangeableState");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_SetListItemWidgetButtonChangeableState, InListItemIndex) == 0x000000, "Member 'WBP_Friend_Sub_AddFriend_C_SetListItemWidgetButtonChangeableState::InListItemIndex' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_SetListItemWidgetButtonChangeableState, bEnable) == 0x000004, "Member 'WBP_Friend_Sub_AddFriend_C_SetListItemWidgetButtonChangeableState::bEnable' has a wrong offset!");

// Function WBP_Friend_Sub_AddFriend.WBP_Friend_Sub_AddFriend_C.OnDirectionEvent
// 0x0010 (0x0010 - 0x0000)
struct WBP_Friend_Sub_AddFriend_C_OnDirectionEvent final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EUnionUIControlDir                            Dir;                                               // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_AddFriend_C_OnDirectionEvent) == 0x000008, "Wrong alignment on WBP_Friend_Sub_AddFriend_C_OnDirectionEvent");
static_assert(sizeof(WBP_Friend_Sub_AddFriend_C_OnDirectionEvent) == 0x000010, "Wrong size on WBP_Friend_Sub_AddFriend_C_OnDirectionEvent");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_OnDirectionEvent, Button) == 0x000000, "Member 'WBP_Friend_Sub_AddFriend_C_OnDirectionEvent::Button' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_OnDirectionEvent, Dir) == 0x000008, "Member 'WBP_Friend_Sub_AddFriend_C_OnDirectionEvent::Dir' has a wrong offset!");

// Function WBP_Friend_Sub_AddFriend.WBP_Friend_Sub_AddFriend_C.GenerateSubMenu
// 0x0008 (0x0008 - 0x0000)
struct WBP_Friend_Sub_AddFriend_C_GenerateSubMenu final
{
public:
	class UUnionUIButtonBase*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_AddFriend_C_GenerateSubMenu) == 0x000008, "Wrong alignment on WBP_Friend_Sub_AddFriend_C_GenerateSubMenu");
static_assert(sizeof(WBP_Friend_Sub_AddFriend_C_GenerateSubMenu) == 0x000008, "Wrong size on WBP_Friend_Sub_AddFriend_C_GenerateSubMenu");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_GenerateSubMenu, Button) == 0x000000, "Member 'WBP_Friend_Sub_AddFriend_C_GenerateSubMenu::Button' has a wrong offset!");

// Function WBP_Friend_Sub_AddFriend.WBP_Friend_Sub_AddFriend_C.SetScrollBoxVisibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_Friend_Sub_AddFriend_C_SetScrollBoxVisibility final
{
public:
	ESlateVisibility                              Param;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_AddFriend_C_SetScrollBoxVisibility) == 0x000001, "Wrong alignment on WBP_Friend_Sub_AddFriend_C_SetScrollBoxVisibility");
static_assert(sizeof(WBP_Friend_Sub_AddFriend_C_SetScrollBoxVisibility) == 0x000001, "Wrong size on WBP_Friend_Sub_AddFriend_C_SetScrollBoxVisibility");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_SetScrollBoxVisibility, Param) == 0x000000, "Member 'WBP_Friend_Sub_AddFriend_C_SetScrollBoxVisibility::Param' has a wrong offset!");

// Function WBP_Friend_Sub_AddFriend.WBP_Friend_Sub_AddFriend_C.ExecuteUbergraph_WBP_Friend_Sub_AddFriend
// 0x07B8 (0x07B8 - 0x0000)
struct WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_4;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Friend_Sub_PlayerPlate_Small_C*    K2Node_CustomEvent_InItemListWidget;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFriendListPlayerInfo                  K2Node_CustomEvent_InListPlayerInfo;               // 0x0018(0x00F0)()
	int32                                         K2Node_CustomEvent_InButtonIndex;                  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Friend_Sub_PlayerPlate_C*          CallFunc_GetMainWidget_OutMainWidget;              // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_5;                       // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckSubMenuWidgetDisplay_ReturnValue;    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate;          // 0x0128(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInPlayFocusSound_1;                  // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_143[0x5];                                      // 0x0143(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_3;                       // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Friend_Sub_PlayerPlate_Small_C*    CallFunc_Create_ReturnValue;                       // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_2;                       // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PanelIndex;                     // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ButtonIndex;                    // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0170(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_1;        // 0x0180(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0198(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x01A8(0x0010)()
	class FText                                   CallFunc_GetInputText_OutInputText;                // 0x01B8(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UFriendListMainWidget*            CallFunc_GetMainWidget_ReturnValue;                // 0x01F0(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCommon_UserSearchData>         K2Node_Event_InUserSearchData;                     // 0x01F8(0x0010)(ConstParm, ReferenceParm)
	EFriendListCommandType                        K2Node_Event_CommandType;                          // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InButtonIndex;                        // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInCanceled;                          // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckShowPfProfile_ReturnValue;           // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0213(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0215(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0216(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0217(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A[0x2];                                      // 0x021A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Friend_Sub_PlayerPlate_Small_C*    CallFunc_Array_Get_Item;                           // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Friend_Sub_PlayerPlate_C*          CallFunc_GetMainWidget_OutMainWidget_1;            // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFriendListPlayerInfo                  CallFunc_GetSearchPlayerInfo_OutSearchPlayerInfo;  // 0x0240(0x00F0)()
	struct FFriendListPlayerInfo                  CallFunc_GetSearchPlayerInfo_OutSearchPlayerInfo_1; // 0x0330(0x00F0)()
	struct FFriendListPlayerInfo                  CallFunc_Array_Get_Item_1;                         // 0x0420(0x00F0)()
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511[0x3];                                      // 0x0511(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InListItemIndex_1;                    // 0x0514(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInEnable_1;                          // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_519[0x7];                                      // 0x0519(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_Event_PlayerController;                     // 0x0520(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInPlayFocusSound;                    // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInEnable;                            // 0x0529(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52A[0x2];                                      // 0x052A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetZOrder_ReturnValue;                    // 0x052C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InListItemIndex;                      // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x0534(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_535[0x3];                                      // 0x0535(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Friend_Sub_PlayerPlate_Small_C*    CallFunc_Array_Get_Item_2;                         // 0x0540(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Friend_Sub_PlayerPlate_C*          CallFunc_GetMainWidget_OutMainWidget_2;            // 0x0548(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_551[0x3];                                      // 0x0551(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0554(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_559[0x3];                                      // 0x0559(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x055C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0560(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_564[0x4];                                      // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UForceNextSequenceManagerSubsytem*      CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0568(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_571[0x3];                                      // 0x0571(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceNextSequenceManagerSubsytem*      CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0578(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0580(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_581[0x3];                                      // 0x0581(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0584(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceNextSequenceManagerSubsytem*      CallFunc_GetWorldSubsystem_ReturnValue_2;          // 0x0588(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue_1;           // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EButtonFocusType                              Temp_byte_Variable;                                // 0x0591(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_2;         // 0x0592(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_593[0x5];                                      // 0x0593(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Friend_Sub_PlayerPlate_Small_C*    CallFunc_Array_Get_Item_3;                         // 0x0598(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_3;         // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A1[0x7];                                      // 0x05A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Friend_Sub_PlayerPlate_C*          CallFunc_GetMainWidget_OutMainWidget_3;            // 0x05A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EButtonFocusType                              Temp_byte_Variable_1;                              // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x05B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x05B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EButtonFocusType                              K2Node_Select_Default;                             // 0x05B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button, EUnionUIControlDir Dir)> K2Node_CreateDelegate_OutputDelegate_2; // 0x05B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C4[0x4];                                      // 0x05C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button_1;                       // 0x05C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EUnionUIControlDir                            K2Node_CustomEvent_Dir;                            // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D1[0x7];                                      // 0x05D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFriendListMainWidget*            CallFunc_GetMainWidget_ReturnValue_1;              // 0x05D8(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EFriendListCommandType                        Temp_byte_Variable_2;                              // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E1[0x7];                                      // 0x05E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Friend_CMN_Window_C*               K2Node_DynamicCast_AsWBP_Friend_CMN_Window;        // 0x05E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFriendListCommandType                        Temp_byte_Variable_3;                              // 0x05F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F2[0x6];                                      // 0x05F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x05F8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_4;                         // 0x0608(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Friend_Sub_PlayerPlate_Small_C*    K2Node_DynamicCast_AsWBP_Friend_Sub_Player_Plate_Small; // 0x0610(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_619[0x3];                                      // 0x0619(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x061C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_621[0x3];                                      // 0x0621(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0624(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUnionUIButtonsPanel*                   CallFunc_CreateButtonsPanel_ReturnValue;           // 0x0628(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0631(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue_2;           // 0x0632(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFriendListCommandType                        K2Node_Select_Default_1;                           // 0x0633(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0634(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0638(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x063C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63D[0x3];                                      // 0x063D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_644[0x4];                                      // 0x0644(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Friend_Sub_PlayerPlate_Small_C*    CallFunc_Array_Get_Item_5;                         // 0x0648(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0654(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0655(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0656(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_657[0x1];                                      // 0x0657(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUnionUIButtonBase* Button, int32 PanelIndex, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0658(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_669[0x7];                                      // 0x0669(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUnionUIButtonBase*                     K2Node_CustomEvent_Button;                         // 0x0670(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSubMenuWidgetTranslation_OutTranslation; // 0x0678(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Friend_NumberInput_Window_C*       CallFunc_Create_ReturnValue_1;                     // 0x0688(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUnionUIButtonBase* Button)> K2Node_CreateDelegate_OutputDelegate_4;        // 0x0690(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x06A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A4[0x4];                                      // 0x06A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Friend_Sub_PlayerPlate_Small_C*    CallFunc_Array_Get_Item_6;                         // 0x06A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFriendListPlayerInfo                  CallFunc_Array_Get_Item_7;                         // 0x06B0(0x00F0)()
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_4;         // 0x07A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Event_Param;                                // 0x07A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x07A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A3[0x5];                                      // 0x07A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Friend_SmallWindow_Top_C*          K2Node_DynamicCast_AsWBP_Friend_Small_Window_Top;  // 0x07A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x07B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend) == 0x000008, "Wrong alignment on WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend");
static_assert(sizeof(WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend) == 0x0007B8, "Wrong size on WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend, EntryPoint) == 0x000000, "Member 'WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend, K2Node_CustomEvent_Button_4) == 0x000008, "Member 'WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend::K2Node_CustomEvent_Button_4' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend, K2Node_CustomEvent_InItemListWidget) == 0x000010, "Member 'WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend::K2Node_CustomEvent_InItemListWidget' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend, K2Node_CustomEvent_InListPlayerInfo) == 0x000018, "Member 'WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend::K2Node_CustomEvent_InListPlayerInfo' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend, K2Node_CustomEvent_InButtonIndex) == 0x000108, "Member 'WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend::K2Node_CustomEvent_InButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend, CallFunc_Array_Length_ReturnValue) == 0x00010C, "Member 'WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend, CallFunc_GetMainWidget_OutMainWidget) == 0x000110, "Member 'WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend::CallFunc_GetMainWidget_OutMainWidget' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend, K2Node_CustomEvent_Button_5) == 0x000118, "Member 'WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend::K2Node_CustomEvent_Button_5' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend, CallFunc_CheckSubMenuWidgetDisplay_ReturnValue) == 0x000120, "Member 'WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend::CallFunc_CheckSubMenuWidgetDisplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend, Temp_int_Loop_Counter_Variable) == 0x000124, "Member 'WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend, K2Node_CreateDelegate_OutputDelegate) == 0x000128, "Member 'WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend, CallFunc_Add_IntInt_ReturnValue) == 0x000138, "Member 'WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend, CallFunc_Array_Length_ReturnValue_1) == 0x00013C, "Member 'WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000140, "Member 'WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend, CallFunc_Less_IntInt_ReturnValue) == 0x000141, "Member 'WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend, K2Node_Event_bInPlayFocusSound_1) == 0x000142, "Member 'WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend::K2Node_Event_bInPlayFocusSound_1' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend, K2Node_CustomEvent_Button_3) == 0x000148, "Member 'WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend::K2Node_CustomEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend, CallFunc_Create_ReturnValue) == 0x000150, "Member 'WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend, K2Node_CustomEvent_Button_2) == 0x000158, "Member 'WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend::K2Node_CustomEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend, K2Node_CustomEvent_PanelIndex) == 0x000160, "Member 'WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend::K2Node_CustomEvent_PanelIndex' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend, K2Node_CustomEvent_ButtonIndex) == 0x000164, "Member 'WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend::K2Node_CustomEvent_ButtonIndex' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend, CallFunc_Array_Add_ReturnValue) == 0x000168, "Member 'WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend, K2Node_SwitchInteger_CmpSuccess) == 0x00016C, "Member 'WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend, K2Node_MakeArray_Array) == 0x000170, "Member 'WBP_Friend_Sub_AddFriend_C_ExecuteUbergraph_WBP_Friend_Sub_AddFriend::K2Node_MakeArray_Array' has a wrong offset!");
