#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StatusInfo_Sub_HonorLegend

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UNION_structs.hpp"
#include "UNION_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_StatusInfo_Sub_HonorLegend.WBP_StatusInfo_Sub_HonorLegend_C
// 0x00D8 (0x0468 - 0x0390)
class UWBP_StatusInfo_Sub_HonorLegend_C final : public ULegendCompeRewardInfoSubWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 base;                                              // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 base_1;                                            // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base02;                                            // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base02_1;                                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base02_2;                                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base02_3;                                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_02;                                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_02_line;                                      // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_02_line_1;                                    // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff;                                               // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_1;                                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_2;                                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_3;                                             // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_4;                                             // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_01;                                            // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlag_Left;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RaceFlag_Right;                                    // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_HeaderGrade_Legend;                            // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUnionRichTextBlock*                    TXT_HeaderRanking_Legend;                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatusInfo_Sub_HonorTable_01_C*    WBP_StatusInfo_Sub_HonorTable_01;                  // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatusInfo_Sub_HonorTable_01_C*    WBP_StatusInfo_Sub_HonorTable_01_RankingLegend;    // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatusInfo_Sub_HonorTable_01_C*    WBP_StatusInfo_Sub_HonorTable_02;                  // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatusInfo_Sub_HonorTable_01_C*    WBP_StatusInfo_Sub_HonorTable_02_RankingLegend;    // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatusInfo_Sub_HonorTable_01_C*    WBP_StatusInfo_Sub_HonorTable_03;                  // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatusInfo_Sub_HonorTable_01_C*    WBP_StatusInfo_Sub_HonorTable_04;                  // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatusInfo_Sub_HonorTable_01_C*    WBP_StatusInfo_Sub_HonorTable_05;                  // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_StatusInfo_Sub_HonorLegend(int32 EntryPoint);
	void SetDispData(const struct FLegendCompeRewardInfoDispData& InDispData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_StatusInfo_Sub_HonorLegend_C">();
	}
	static class UWBP_StatusInfo_Sub_HonorLegend_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_StatusInfo_Sub_HonorLegend_C>();
	}
};
static_assert(alignof(UWBP_StatusInfo_Sub_HonorLegend_C) == 0x000008, "Wrong alignment on UWBP_StatusInfo_Sub_HonorLegend_C");
static_assert(sizeof(UWBP_StatusInfo_Sub_HonorLegend_C) == 0x000468, "Wrong size on UWBP_StatusInfo_Sub_HonorLegend_C");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorLegend_C, UberGraphFrame) == 0x000390, "Member 'UWBP_StatusInfo_Sub_HonorLegend_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorLegend_C, base) == 0x000398, "Member 'UWBP_StatusInfo_Sub_HonorLegend_C::base' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorLegend_C, base_1) == 0x0003A0, "Member 'UWBP_StatusInfo_Sub_HonorLegend_C::base_1' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorLegend_C, Base02) == 0x0003A8, "Member 'UWBP_StatusInfo_Sub_HonorLegend_C::Base02' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorLegend_C, Base02_1) == 0x0003B0, "Member 'UWBP_StatusInfo_Sub_HonorLegend_C::Base02_1' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorLegend_C, Base02_2) == 0x0003B8, "Member 'UWBP_StatusInfo_Sub_HonorLegend_C::Base02_2' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorLegend_C, Base02_3) == 0x0003C0, "Member 'UWBP_StatusInfo_Sub_HonorLegend_C::Base02_3' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorLegend_C, Base_02) == 0x0003C8, "Member 'UWBP_StatusInfo_Sub_HonorLegend_C::Base_02' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorLegend_C, Base_02_line) == 0x0003D0, "Member 'UWBP_StatusInfo_Sub_HonorLegend_C::Base_02_line' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorLegend_C, Base_02_line_1) == 0x0003D8, "Member 'UWBP_StatusInfo_Sub_HonorLegend_C::Base_02_line_1' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorLegend_C, Eff) == 0x0003E0, "Member 'UWBP_StatusInfo_Sub_HonorLegend_C::Eff' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorLegend_C, Eff_1) == 0x0003E8, "Member 'UWBP_StatusInfo_Sub_HonorLegend_C::Eff_1' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorLegend_C, Eff_2) == 0x0003F0, "Member 'UWBP_StatusInfo_Sub_HonorLegend_C::Eff_2' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorLegend_C, Eff_3) == 0x0003F8, "Member 'UWBP_StatusInfo_Sub_HonorLegend_C::Eff_3' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorLegend_C, Eff_4) == 0x000400, "Member 'UWBP_StatusInfo_Sub_HonorLegend_C::Eff_4' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorLegend_C, Eff_01) == 0x000408, "Member 'UWBP_StatusInfo_Sub_HonorLegend_C::Eff_01' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorLegend_C, RaceFlag_Left) == 0x000410, "Member 'UWBP_StatusInfo_Sub_HonorLegend_C::RaceFlag_Left' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorLegend_C, RaceFlag_Right) == 0x000418, "Member 'UWBP_StatusInfo_Sub_HonorLegend_C::RaceFlag_Right' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorLegend_C, TXT_HeaderGrade_Legend) == 0x000420, "Member 'UWBP_StatusInfo_Sub_HonorLegend_C::TXT_HeaderGrade_Legend' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorLegend_C, TXT_HeaderRanking_Legend) == 0x000428, "Member 'UWBP_StatusInfo_Sub_HonorLegend_C::TXT_HeaderRanking_Legend' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorLegend_C, WBP_StatusInfo_Sub_HonorTable_01) == 0x000430, "Member 'UWBP_StatusInfo_Sub_HonorLegend_C::WBP_StatusInfo_Sub_HonorTable_01' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorLegend_C, WBP_StatusInfo_Sub_HonorTable_01_RankingLegend) == 0x000438, "Member 'UWBP_StatusInfo_Sub_HonorLegend_C::WBP_StatusInfo_Sub_HonorTable_01_RankingLegend' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorLegend_C, WBP_StatusInfo_Sub_HonorTable_02) == 0x000440, "Member 'UWBP_StatusInfo_Sub_HonorLegend_C::WBP_StatusInfo_Sub_HonorTable_02' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorLegend_C, WBP_StatusInfo_Sub_HonorTable_02_RankingLegend) == 0x000448, "Member 'UWBP_StatusInfo_Sub_HonorLegend_C::WBP_StatusInfo_Sub_HonorTable_02_RankingLegend' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorLegend_C, WBP_StatusInfo_Sub_HonorTable_03) == 0x000450, "Member 'UWBP_StatusInfo_Sub_HonorLegend_C::WBP_StatusInfo_Sub_HonorTable_03' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorLegend_C, WBP_StatusInfo_Sub_HonorTable_04) == 0x000458, "Member 'UWBP_StatusInfo_Sub_HonorLegend_C::WBP_StatusInfo_Sub_HonorTable_04' has a wrong offset!");
static_assert(offsetof(UWBP_StatusInfo_Sub_HonorLegend_C, WBP_StatusInfo_Sub_HonorTable_05) == 0x000460, "Member 'UWBP_StatusInfo_Sub_HonorLegend_C::WBP_StatusInfo_Sub_HonorTable_05' has a wrong offset!");

}

