#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LegendInfo

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_LegendInfo.WBP_LegendInfo_C.ExecuteUbergraph_WBP_LegendInfo
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameEventPhase                               Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLegendCompeInfoDispData               K2Node_Event_InDispData;                           // 0x0010(0x0030)(ConstParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0040(0x0010)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0050(0x0010)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0068(0x0010)()
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0078(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0088(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0010)()
};
static_assert(alignof(WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo) == 0x000008, "Wrong alignment on WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo");
static_assert(sizeof(WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo) == 0x0000F0, "Wrong size on WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo");
static_assert(offsetof(WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo, EntryPoint) == 0x000000, "Member 'WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo, Temp_byte_Variable) == 0x000004, "Member 'WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo, Temp_byte_Variable_2) == 0x000006, "Member 'WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo, Temp_byte_Variable_3) == 0x000007, "Member 'WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo, Temp_byte_Variable_4) == 0x000008, "Member 'WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo, Temp_byte_Variable_5) == 0x000009, "Member 'WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo, Temp_byte_Variable_6) == 0x00000A, "Member 'WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo, K2Node_Event_InDispData) == 0x000010, "Member 'WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo::K2Node_Event_InDispData' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000040, "Member 'WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000050, "Member 'WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo, K2Node_Select_Default) == 0x000060, "Member 'WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo, CallFunc_MakeLiteralText_ReturnValue) == 0x000068, "Member 'WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo, CallFunc_GetEmptyText_ReturnValue) == 0x000078, "Member 'WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo, K2Node_MakeStruct_FormatArgumentData) == 0x000088, "Member 'WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo, K2Node_MakeArray_Array) == 0x0000D0, "Member 'WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'WBP_LegendInfo_C_ExecuteUbergraph_WBP_LegendInfo::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_LegendInfo.WBP_LegendInfo_C.SetCurrentRateNumber
// 0x0058 (0x0058 - 0x0000)
struct WBP_LegendInfo_C_SetCurrentRateNumber final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetCurrentRatePartialVisibilityByDigit_ReturnValue; // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentRatePartialNumberByDigit_ReturnValue; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UImage*>                         K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LegendInfo_C_SetCurrentRateNumber) == 0x000008, "Wrong alignment on WBP_LegendInfo_C_SetCurrentRateNumber");
static_assert(sizeof(WBP_LegendInfo_C_SetCurrentRateNumber) == 0x000058, "Wrong size on WBP_LegendInfo_C_SetCurrentRateNumber");
static_assert(offsetof(WBP_LegendInfo_C_SetCurrentRateNumber, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_LegendInfo_C_SetCurrentRateNumber::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_SetCurrentRateNumber, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_LegendInfo_C_SetCurrentRateNumber::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_SetCurrentRateNumber, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_LegendInfo_C_SetCurrentRateNumber::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_SetCurrentRateNumber, CallFunc_GetCurrentRatePartialVisibilityByDigit_ReturnValue) == 0x00000C, "Member 'WBP_LegendInfo_C_SetCurrentRateNumber::CallFunc_GetCurrentRatePartialVisibilityByDigit_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_SetCurrentRateNumber, CallFunc_GetCurrentRatePartialNumberByDigit_ReturnValue) == 0x000010, "Member 'WBP_LegendInfo_C_SetCurrentRateNumber::CallFunc_GetCurrentRatePartialNumberByDigit_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_SetCurrentRateNumber, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'WBP_LegendInfo_C_SetCurrentRateNumber::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_SetCurrentRateNumber, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000018, "Member 'WBP_LegendInfo_C_SetCurrentRateNumber::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_SetCurrentRateNumber, K2Node_MakeArray_Array) == 0x000020, "Member 'WBP_LegendInfo_C_SetCurrentRateNumber::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_SetCurrentRateNumber, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_LegendInfo_C_SetCurrentRateNumber::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_SetCurrentRateNumber, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_LegendInfo_C_SetCurrentRateNumber::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_SetCurrentRateNumber, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WBP_LegendInfo_C_SetCurrentRateNumber::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_SetCurrentRateNumber, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000048, "Member 'WBP_LegendInfo_C_SetCurrentRateNumber::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_SetCurrentRateNumber, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000050, "Member 'WBP_LegendInfo_C_SetCurrentRateNumber::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_LegendInfo.WBP_LegendInfo_C.SetInfoDispData
// 0x0030 (0x0030 - 0x0000)
struct WBP_LegendInfo_C_SetInfoDispData final
{
public:
	struct FLegendCompeInfoDispData               InDispData;                                        // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_LegendInfo_C_SetInfoDispData) == 0x000008, "Wrong alignment on WBP_LegendInfo_C_SetInfoDispData");
static_assert(sizeof(WBP_LegendInfo_C_SetInfoDispData) == 0x000030, "Wrong size on WBP_LegendInfo_C_SetInfoDispData");
static_assert(offsetof(WBP_LegendInfo_C_SetInfoDispData, InDispData) == 0x000000, "Member 'WBP_LegendInfo_C_SetInfoDispData::InDispData' has a wrong offset!");

// Function WBP_LegendInfo.WBP_LegendInfo_C.SetPopupDispState
// 0x000C (0x000C - 0x0000)
struct WBP_LegendInfo_C_SetPopupDispState final
{
public:
	EGameEventPhase                               Phase;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SwitcherIndex;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LegendInfo_C_SetPopupDispState) == 0x000004, "Wrong alignment on WBP_LegendInfo_C_SetPopupDispState");
static_assert(sizeof(WBP_LegendInfo_C_SetPopupDispState) == 0x00000C, "Wrong size on WBP_LegendInfo_C_SetPopupDispState");
static_assert(offsetof(WBP_LegendInfo_C_SetPopupDispState, Phase) == 0x000000, "Member 'WBP_LegendInfo_C_SetPopupDispState::Phase' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_SetPopupDispState, SwitcherIndex) == 0x000004, "Member 'WBP_LegendInfo_C_SetPopupDispState::SwitcherIndex' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_SetPopupDispState, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'WBP_LegendInfo_C_SetPopupDispState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_LegendInfo.WBP_LegendInfo_C.SetRateDispState
// 0x0004 (0x0004 - 0x0000)
struct WBP_LegendInfo_C_SetRateDispState final
{
public:
	EGameEventPhase                               Phase;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlayed;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsQualified;                                       // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_LegendInfo_C_SetRateDispState) == 0x000001, "Wrong alignment on WBP_LegendInfo_C_SetRateDispState");
static_assert(sizeof(WBP_LegendInfo_C_SetRateDispState) == 0x000004, "Wrong size on WBP_LegendInfo_C_SetRateDispState");
static_assert(offsetof(WBP_LegendInfo_C_SetRateDispState, Phase) == 0x000000, "Member 'WBP_LegendInfo_C_SetRateDispState::Phase' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_SetRateDispState, IsPlayed) == 0x000001, "Member 'WBP_LegendInfo_C_SetRateDispState::IsPlayed' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_SetRateDispState, IsQualified) == 0x000002, "Member 'WBP_LegendInfo_C_SetRateDispState::IsQualified' has a wrong offset!");
static_assert(offsetof(WBP_LegendInfo_C_SetRateDispState, K2Node_SwitchEnum_CmpSuccess) == 0x000003, "Member 'WBP_LegendInfo_C_SetRateDispState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

