#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Advertise_Start

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UNION_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Advertise_Start.WBP_Advertise_Start_C.ExecuteUbergraph_WBP_Advertise_Start
// 0x0170 (0x0170 - 0x0000)
struct WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCopyrightText_ReturnValue;             // 0x0018(0x0010)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PauseAnimation_ReturnValue_1;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAdvertiseState                               CallFunc_GetSwitcherIndex_OutState;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PauseAnimation_ReturnValue_2;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEndLogos_LogosEnd;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoundHandle                           CallFunc_SoundPlay_ReturnValue;                    // 0x005C(0x0004)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAdvertiseState                               CallFunc_GetSwitcherIndex_OutState_1;              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x5];                                       // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAdvertiseState                               CallFunc_GetSwitcherIndex_OutState_2;              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00A8(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x00F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAdvertiseState                               CallFunc_GetSwitcherIndex_OutState_3;              // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0104(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0118(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSwitch2_ReturnValue;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0148(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_3;        // 0x0158(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1;  // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_2;  // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start) == 0x000008, "Wrong alignment on WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start");
static_assert(sizeof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start) == 0x000170, "Wrong size on WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, EntryPoint) == 0x000000, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_GetCopyrightText_ReturnValue) == 0x000018, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_GetCopyrightText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_PauseAnimation_ReturnValue) == 0x000038, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_PauseAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_PauseAnimation_ReturnValue_1) == 0x00003C, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_PauseAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_GetSwitcherIndex_OutState) == 0x000040, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_GetSwitcherIndex_OutState' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_PauseAnimation_ReturnValue_2) == 0x000044, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_PauseAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, K2Node_SwitchEnum_CmpSuccess) == 0x000048, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_PlayAnimation_ReturnValue_2) == 0x000050, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_IsEndLogos_LogosEnd) == 0x000058, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_IsEndLogos_LogosEnd' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_SoundPlay_ReturnValue) == 0x00005C, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_SoundPlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, K2Node_CreateDelegate_OutputDelegate_1) == 0x000060, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, K2Node_CreateDelegate_OutputDelegate_2) == 0x000070, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_GetSwitcherIndex_OutState_1) == 0x000080, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_GetSwitcherIndex_OutState_1' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000081, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000082, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_PlayAnimation_ReturnValue_3) == 0x000088, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_GetSwitcherIndex_OutState_2) == 0x000090, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_GetSwitcherIndex_OutState_2' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000091, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, K2Node_CreateDelegate_OutputDelegate_3) == 0x000094, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x0000A4, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, K2Node_Event_MyGeometry) == 0x0000A8, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, K2Node_Event_InDeltaTime) == 0x0000E0, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000E8, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0000F0, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_PlayAnimation_ReturnValue_4) == 0x0000F8, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_GetSwitcherIndex_OutState_3) == 0x000100, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_GetSwitcherIndex_OutState_3' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, K2Node_CreateDelegate_OutputDelegate_4) == 0x000104, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000114, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, K2Node_CreateDelegate_OutputDelegate_5) == 0x000118, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_PlayAnimation_ReturnValue_5) == 0x000128, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, K2Node_CreateDelegate_OutputDelegate_6) == 0x000130, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_IsSwitch2_ReturnValue) == 0x000140, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_IsSwitch2_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x000148, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_BooleanAND_ReturnValue) == 0x000150, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_K2_SetTimerDelegate_ReturnValue_3) == 0x000158, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_K2_SetTimerDelegate_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000160, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1) == 0x000164, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_2) == 0x000168, "Member 'WBP_Advertise_Start_C_ExecuteUbergraph_WBP_Advertise_Start::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_2' has a wrong offset!");

// Function WBP_Advertise_Start.WBP_Advertise_Start_C.GetAnimationOut
// 0x0008 (0x0008 - 0x0000)
struct WBP_Advertise_Start_C_GetAnimationOut final
{
public:
	class UWidgetAnimation*                       OutAnimation;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Advertise_Start_C_GetAnimationOut) == 0x000008, "Wrong alignment on WBP_Advertise_Start_C_GetAnimationOut");
static_assert(sizeof(WBP_Advertise_Start_C_GetAnimationOut) == 0x000008, "Wrong size on WBP_Advertise_Start_C_GetAnimationOut");
static_assert(offsetof(WBP_Advertise_Start_C_GetAnimationOut, OutAnimation) == 0x000000, "Member 'WBP_Advertise_Start_C_GetAnimationOut::OutAnimation' has a wrong offset!");

// Function WBP_Advertise_Start.WBP_Advertise_Start_C.GetSwitcherIndex
// 0x000C (0x000C - 0x0000)
struct WBP_Advertise_Start_C_GetSwitcherIndex final
{
public:
	EAdvertiseState                               OutState;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAdvertiseState                               OutState2;                                         // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAdvertiseState                               OutState_0;                                        // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Advertise_Start_C_GetSwitcherIndex) == 0x000004, "Wrong alignment on WBP_Advertise_Start_C_GetSwitcherIndex");
static_assert(sizeof(WBP_Advertise_Start_C_GetSwitcherIndex) == 0x00000C, "Wrong size on WBP_Advertise_Start_C_GetSwitcherIndex");
static_assert(offsetof(WBP_Advertise_Start_C_GetSwitcherIndex, OutState) == 0x000000, "Member 'WBP_Advertise_Start_C_GetSwitcherIndex::OutState' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_GetSwitcherIndex, OutState2) == 0x000001, "Member 'WBP_Advertise_Start_C_GetSwitcherIndex::OutState2' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_GetSwitcherIndex, OutState_0) == 0x000002, "Member 'WBP_Advertise_Start_C_GetSwitcherIndex::OutState_0' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_GetSwitcherIndex, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000004, "Member 'WBP_Advertise_Start_C_GetSwitcherIndex::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_GetSwitcherIndex, K2Node_SwitchInteger_CmpSuccess) == 0x000008, "Member 'WBP_Advertise_Start_C_GetSwitcherIndex::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WBP_Advertise_Start.WBP_Advertise_Start_C.IsEndLogos
// 0x000F (0x000F - 0x0000)
struct WBP_Advertise_Start_C_IsEndLogos final
{
public:
	bool                                          LogosEnd;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAppSupportedPlatform                         CallFunc_GetPlatform_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAdvertiseState                               CallFunc_GetSwitcherIndex_OutState;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisibleCompanyNameMilestoneVersion_ReturnValue; // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnableAdvertiseRatingMilestoneVersion_ReturnValue; // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnableAdvertiseRatingMilestoneVersion_ReturnValue_1; // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOfficialVersion_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAdvertiseState                               CallFunc_GetSwitcherIndex_OutState_1;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAdvertiseState                               CallFunc_GetSwitcherIndex_OutState_2;              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Advertise_Start_C_IsEndLogos) == 0x000001, "Wrong alignment on WBP_Advertise_Start_C_IsEndLogos");
static_assert(sizeof(WBP_Advertise_Start_C_IsEndLogos) == 0x00000F, "Wrong size on WBP_Advertise_Start_C_IsEndLogos");
static_assert(offsetof(WBP_Advertise_Start_C_IsEndLogos, LogosEnd) == 0x000000, "Member 'WBP_Advertise_Start_C_IsEndLogos::LogosEnd' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_IsEndLogos, CallFunc_GetPlatform_ReturnValue) == 0x000001, "Member 'WBP_Advertise_Start_C_IsEndLogos::CallFunc_GetPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_IsEndLogos, CallFunc_GetSwitcherIndex_OutState) == 0x000002, "Member 'WBP_Advertise_Start_C_IsEndLogos::CallFunc_GetSwitcherIndex_OutState' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_IsEndLogos, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000003, "Member 'WBP_Advertise_Start_C_IsEndLogos::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_IsEndLogos, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000004, "Member 'WBP_Advertise_Start_C_IsEndLogos::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_IsEndLogos, CallFunc_IsVisibleCompanyNameMilestoneVersion_ReturnValue) == 0x000005, "Member 'WBP_Advertise_Start_C_IsEndLogos::CallFunc_IsVisibleCompanyNameMilestoneVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_IsEndLogos, CallFunc_IsEnableAdvertiseRatingMilestoneVersion_ReturnValue) == 0x000006, "Member 'WBP_Advertise_Start_C_IsEndLogos::CallFunc_IsEnableAdvertiseRatingMilestoneVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_IsEndLogos, CallFunc_IsEnableAdvertiseRatingMilestoneVersion_ReturnValue_1) == 0x000007, "Member 'WBP_Advertise_Start_C_IsEndLogos::CallFunc_IsEnableAdvertiseRatingMilestoneVersion_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_IsEndLogos, CallFunc_IsOfficialVersion_ReturnValue) == 0x000008, "Member 'WBP_Advertise_Start_C_IsEndLogos::CallFunc_IsOfficialVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_IsEndLogos, CallFunc_GetSwitcherIndex_OutState_1) == 0x000009, "Member 'WBP_Advertise_Start_C_IsEndLogos::CallFunc_GetSwitcherIndex_OutState_1' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_IsEndLogos, CallFunc_GetSwitcherIndex_OutState_2) == 0x00000A, "Member 'WBP_Advertise_Start_C_IsEndLogos::CallFunc_GetSwitcherIndex_OutState_2' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_IsEndLogos, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00000B, "Member 'WBP_Advertise_Start_C_IsEndLogos::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_IsEndLogos, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x00000C, "Member 'WBP_Advertise_Start_C_IsEndLogos::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_IsEndLogos, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x00000D, "Member 'WBP_Advertise_Start_C_IsEndLogos::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_IsEndLogos, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x00000E, "Member 'WBP_Advertise_Start_C_IsEndLogos::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");

// Function WBP_Advertise_Start.WBP_Advertise_Start_C.SetLogosTime
// 0x0008 (0x0008 - 0x0000)
struct WBP_Advertise_Start_C_SetLogosTime final
{
public:
	double                                        InTime;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Advertise_Start_C_SetLogosTime) == 0x000008, "Wrong alignment on WBP_Advertise_Start_C_SetLogosTime");
static_assert(sizeof(WBP_Advertise_Start_C_SetLogosTime) == 0x000008, "Wrong size on WBP_Advertise_Start_C_SetLogosTime");
static_assert(offsetof(WBP_Advertise_Start_C_SetLogosTime, InTime) == 0x000000, "Member 'WBP_Advertise_Start_C_SetLogosTime::InTime' has a wrong offset!");

// Function WBP_Advertise_Start.WBP_Advertise_Start_C.SetNextLogoState
// 0x0007 (0x0007 - 0x0000)
struct WBP_Advertise_Start_C_SetNextLogoState final
{
public:
	EAppSupportedPlatform                         CallFunc_GetPlatform_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisibleCompanyNameMilestoneVersion_ReturnValue; // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnableAdvertiseRatingMilestoneVersion_ReturnValue; // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOfficialVersion_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAdvertiseState                               CallFunc_GetSwitcherIndex_OutState;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Advertise_Start_C_SetNextLogoState) == 0x000001, "Wrong alignment on WBP_Advertise_Start_C_SetNextLogoState");
static_assert(sizeof(WBP_Advertise_Start_C_SetNextLogoState) == 0x000007, "Wrong size on WBP_Advertise_Start_C_SetNextLogoState");
static_assert(offsetof(WBP_Advertise_Start_C_SetNextLogoState, CallFunc_GetPlatform_ReturnValue) == 0x000000, "Member 'WBP_Advertise_Start_C_SetNextLogoState::CallFunc_GetPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_SetNextLogoState, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'WBP_Advertise_Start_C_SetNextLogoState::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_SetNextLogoState, CallFunc_IsVisibleCompanyNameMilestoneVersion_ReturnValue) == 0x000002, "Member 'WBP_Advertise_Start_C_SetNextLogoState::CallFunc_IsVisibleCompanyNameMilestoneVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_SetNextLogoState, CallFunc_IsEnableAdvertiseRatingMilestoneVersion_ReturnValue) == 0x000003, "Member 'WBP_Advertise_Start_C_SetNextLogoState::CallFunc_IsEnableAdvertiseRatingMilestoneVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_SetNextLogoState, CallFunc_IsOfficialVersion_ReturnValue) == 0x000004, "Member 'WBP_Advertise_Start_C_SetNextLogoState::CallFunc_IsOfficialVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_SetNextLogoState, CallFunc_GetSwitcherIndex_OutState) == 0x000005, "Member 'WBP_Advertise_Start_C_SetNextLogoState::CallFunc_GetSwitcherIndex_OutState' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_SetNextLogoState, K2Node_SwitchEnum_CmpSuccess) == 0x000006, "Member 'WBP_Advertise_Start_C_SetNextLogoState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_Advertise_Start.WBP_Advertise_Start_C.SetSEGALogoTexture
// 0x0002 (0x0002 - 0x0000)
struct WBP_Advertise_Start_C_SetSEGALogoTexture final
{
public:
	ELanguage                                     CallFunc_GetTextLang_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Advertise_Start_C_SetSEGALogoTexture) == 0x000001, "Wrong alignment on WBP_Advertise_Start_C_SetSEGALogoTexture");
static_assert(sizeof(WBP_Advertise_Start_C_SetSEGALogoTexture) == 0x000002, "Wrong size on WBP_Advertise_Start_C_SetSEGALogoTexture");
static_assert(offsetof(WBP_Advertise_Start_C_SetSEGALogoTexture, CallFunc_GetTextLang_ReturnValue) == 0x000000, "Member 'WBP_Advertise_Start_C_SetSEGALogoTexture::CallFunc_GetTextLang_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_SetSEGALogoTexture, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'WBP_Advertise_Start_C_SetSEGALogoTexture::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_Advertise_Start.WBP_Advertise_Start_C.SetSwitcherIndex
// 0x0002 (0x0002 - 0x0000)
struct WBP_Advertise_Start_C_SetSwitcherIndex final
{
public:
	EAdvertiseState                               AdvertiseState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Advertise_Start_C_SetSwitcherIndex) == 0x000001, "Wrong alignment on WBP_Advertise_Start_C_SetSwitcherIndex");
static_assert(sizeof(WBP_Advertise_Start_C_SetSwitcherIndex) == 0x000002, "Wrong size on WBP_Advertise_Start_C_SetSwitcherIndex");
static_assert(offsetof(WBP_Advertise_Start_C_SetSwitcherIndex, AdvertiseState) == 0x000000, "Member 'WBP_Advertise_Start_C_SetSwitcherIndex::AdvertiseState' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_SetSwitcherIndex, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'WBP_Advertise_Start_C_SetSwitcherIndex::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_Advertise_Start.WBP_Advertise_Start_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_Advertise_Start_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Advertise_Start_C_Tick) == 0x000004, "Wrong alignment on WBP_Advertise_Start_C_Tick");
static_assert(sizeof(WBP_Advertise_Start_C_Tick) == 0x00003C, "Wrong size on WBP_Advertise_Start_C_Tick");
static_assert(offsetof(WBP_Advertise_Start_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Advertise_Start_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Advertise_Start_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_Advertise_Start_C_Tick::InDeltaTime' has a wrong offset!");

}

